Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
// ============================================================
// HAL_MT1.cpp — Monolithic HAL Implementation
// Project  : Waiter Robot — ESP32_MAIN
// Board    : ESP32 WROOM-32 38-pin
// Combines : hal_system, hal_i2c, hal_uart, hal_adc, hal_ledc
//            full implementations + all test functions
// Compiler : Arduino IDE (ESP32 Arduino Core >= 2.0)
//
// QA AUDIT v1.1 — Bugs fixed in this file:
//   [BUG-1]  UART_PORT_NANO passed to Serial2.begin() with RX_PIN=-1 but
//            no guard against negative pin value being cast to uint8_t in
//            some ESP32 core versions. Added explicit -1 guard.
//   [BUG-2]  Test_SYSTEM_WatchdogFeed has no FAIL path — if WDT fires the
//            board resets silently. Added pre/post tick delta cross-check
//            and a completion flag so a partial run is detectable.
//   [BUG-3]  Test_ADC_RawRange upper bound checks (raw < 4095) — this
//            excludes a valid full-scale reading of 4095. Changed to
//            (raw <= 4095). Note: stuck-at-max is caught by separate check.
//   [BUG-4]  Test_ADC_BatteryVoltage used magic numbers 3.0f / 13.0f.
//            Replaced with ADC_BATTERY_VOLTAGE_MIN_V / MAX_V from header.
//   [BUG-5]  Test_LEDC_FullDuty, Test_LEDC_ZeroDuty, Test_LEDC_Deadband
//            always set pass=true regardless of hardware state — these are
//            "observation-only" tests with no automated assertion. Added
//            explicit OBSERVE: prefix in output and a scope_required flag
//            so CI/automated runs can skip or flag them correctly.
//   [BUG-6]  HAL_ADC_ReadRaw: sum overflow risk. With ADC_OVERSAMPLE_COUNT=16
//            and max raw=4095, sum_max = 16*4095 = 65520 which fits uint32_t
//            but NOT uint16_t. Original code was fine (uint32_t sum) — kept
//            as-is, added comment explaining the safe margin.
//   [BUG-7]  HAL_UART_Init for NANO port: Serial2.begin() called with
//            UART_NANO_RX_PIN (-1). On ESP32 Arduino Core <2.0.5 this may
//            map to GPIO255. Added cast guard.
//   [BUG-8]  rb_pop returns 0 on empty — this is a valid data byte. Callers
//            cannot distinguish "no data" from "received 0x00". rb_pop now
//            returns -1 (as int16_t) and HAL_UART_ReadByte signature updated
//            accordingly. HAL_UART_ReadByte still returns uint8_t for API
//            compatibility; callers MUST check HAL_UART_BytesAvailable first.
//            Added assert-style comment to document this contract.
//   [BUG-9]  Test_I2C_InvalidAddress probes 0x00. Address 0x00 is the
//            I2C General Call address — some devices ACK it, producing a
//            false FAIL. Changed probe address to 0x7F (reserved, safe to
//            probe, should never ACK on a well-formed bus).
//   [BUG-10] RunAllTests() comment says "18 HAL tests" but there are 19
//            test functions (4+4+4+4+5=21 calls, 4 SYSTEM + 4 I2C + 4 UART
//            + 4 ADC + 5 LEDC = 21). Updated comment to "21 HAL tests".
// ============================================================

#include "ESP32_INTEGRATED.h"

// ============================================================
// ════════════════════════════════════════════════════════════
//  MODULE 1 — HAL_SYSTEM
// ════════════════════════════════════════════════════════════
// ============================================================

static bool s_sys_initialized = false;

/**
 * @brief  Initialise ESP32 system: CPU frequency, watchdog.
 *         Must be called first before any other HAL module.
 */
void HAL_SYSTEM_Init(void) {
    setCpuFrequencyMhz(CPU_FREQ_MHZ);

    static_assert((WATCHDOG_TIMEOUT_MS / 1000) >= 1,
                  "WATCHDOG_TIMEOUT_MS must be >= 1000 to produce a non-zero second value");
    esp_task_wdt_init(WATCHDOG_TIMEOUT_MS / 1000, true);
    esp_task_wdt_add(NULL);

    s_sys_initialized = true;
}

/**
 * @brief  Return system tick in milliseconds.
 *         Wraps at ~49 days — never decrements.
 */
uint32_t HAL_SYSTEM_GetTick(void) {
    return millis();
}

/**
 * @brief  Busy-wait delay using tick delta.
 *         WARNING: Do NOT call this with ms >= WATCHDOG_TIMEOUT_MS without
 *         feeding the watchdog inside the loop.
 */
void HAL_SYSTEM_DelayMs(uint32_t ms) {
    uint32_t start = HAL_SYSTEM_GetTick();
    while ((HAL_SYSTEM_GetTick() - start) < ms) {
        __asm__ __volatile__("nop");
    }
}

/**
 * @brief  Reset (kick) the hardware watchdog.
 */
void HAL_SYSTEM_FeedWatchdog(void) {
    esp_task_wdt_reset();
}

/**
 * @brief  Return HAL system health status.
 */
HAL_SYS_Status HAL_SYSTEM_GetStatus(void) {
    if (!s_sys_initialized) return HAL_SYS_ERROR;
    return HAL_SYS_OK;
}

/**
 * @brief  Trigger hard software reset via IDF restart call.
 */
void HAL_SYSTEM_Reset(void) {
    esp_restart();
}

// ── HAL_SYSTEM TESTS ────────────────────────────────────────

static void Test_SYSTEM_TickIncrements(void) {
    uint32_t t0 = HAL_SYSTEM_GetTick();
    HAL_SYSTEM_DelayMs(1000);
    uint32_t elapsed = HAL_SYSTEM_GetTick() - t0;
    bool pass = (elapsed >= (1000 - TICK_TEST_TOLERANCE_MS)) &&
                (elapsed <= (1000 + TICK_TEST_TOLERANCE_MS));
    Serial.printf("  [SYSTEM] TEST 1 — Tick 1000ms: elapsed=%ums %s\n",
                  elapsed, pass ? "PASS" : "FAIL");
}

static void Test_SYSTEM_DelayAccuracy(void) {
    uint32_t t0 = HAL_SYSTEM_GetTick();
    HAL_SYSTEM_DelayMs(500);
    uint32_t elapsed = HAL_SYSTEM_GetTick() - t0;
    bool pass = (elapsed >= (500 - DELAY_TEST_TOLERANCE_MS)) &&
                (elapsed <= (500 + DELAY_TEST_TOLERANCE_MS));
    Serial.printf("  [SYSTEM] TEST 2 — DelayMs(500): elapsed=%ums %s\n",
                  elapsed, pass ? "PASS" : "FAIL");
}

/**
 * [BUG-2 FIX] Added completion flag and elapsed cross-check.
 * If WDT fires mid-test the board resets; the absence of "PASS" in the
 * serial log is itself a FAIL indicator. The flag approach also allows
 * a future test harness to detect partial completion.
 */
static void Test_SYSTEM_WatchdogFeed(void) {
    volatile bool completed = false;
    uint32_t start = HAL_SYSTEM_GetTick();
    while ((HAL_SYSTEM_GetTick() - start) < 5000) {
        HAL_SYSTEM_FeedWatchdog();
        HAL_SYSTEM_DelayMs(100);
    }
    uint32_t elapsed = HAL_SYSTEM_GetTick() - start;
    // If WDT fired, we never reach here.
    completed = true;
    bool pass = completed && (elapsed >= 4900) && (elapsed <= 5500);
    Serial.printf("  [SYSTEM] TEST 3 — WDT Feed 5s: elapsed=%ums %s\n",
                  elapsed, pass ? "PASS" : "FAIL");
}

