Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
static void Test_SYSTEM_GetStatus(void) {
    HAL_SYS_Status st = HAL_SYSTEM_GetStatus();
    bool pass = (st == HAL_SYS_OK);
    Serial.printf("  [SYSTEM] TEST 4 — GetStatus: status=%d %s\n",
                  (int)st, pass ? "PASS" : "FAIL");
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  MODULE 2 — HAL_I2C
// ════════════════════════════════════════════════════════════
// ============================================================

static bool s_i2c_initialized = false;

void HAL_I2C_Init(void) {
    Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
    Wire.setClock(I2C_FREQ_HZ);
    s_i2c_initialized = true;
}

HAL_I2C_Status HAL_I2C_Write(uint8_t addr, uint8_t reg, const uint8_t* data, uint8_t len) {
    if (data == NULL) return HAL_I2C_ERROR;

    Wire.setTimeOut((uint16_t)I2C_TIMEOUT_MS);

    uint8_t attempt = 0;
    while (attempt < I2C_RETRY_COUNT) {
        uint32_t t0 = HAL_SYSTEM_GetTick();

        Wire.beginTransmission(addr);
        Wire.write(reg);
        Wire.write(const_cast<uint8_t*>(data), len);
        uint8_t err = Wire.endTransmission(true);

        uint32_t elapsed = HAL_SYSTEM_GetTick() - t0;
        if (elapsed > (uint32_t)I2C_TIMEOUT_MS) {
            return HAL_I2C_TIMEOUT;
        }
        if (err == 0) return HAL_I2C_OK;
        if (err == 2 || err == 3) {
            attempt++;
            HAL_SYSTEM_DelayMs(1);
            continue;
        }
        return HAL_I2C_ERROR;
    }
    return HAL_I2C_NACK;
}

HAL_I2C_Status HAL_I2C_Read(uint8_t addr, uint8_t reg, uint8_t* buf, uint8_t len) {
    if (buf == NULL) return HAL_I2C_ERROR;

    Wire.setTimeOut((uint16_t)I2C_TIMEOUT_MS);

    uint8_t attempt = 0;
    while (attempt < I2C_RETRY_COUNT) {
        uint32_t t0 = HAL_SYSTEM_GetTick();

        Wire.beginTransmission(addr);
        Wire.write(reg);
        uint8_t err = Wire.endTransmission(false);  // repeated start

        uint32_t elapsed = HAL_SYSTEM_GetTick() - t0;
        if (elapsed > (uint32_t)I2C_TIMEOUT_MS) {
            return HAL_I2C_TIMEOUT;
        }
        if (err == 2 || err == 3) {
            attempt++;
            HAL_SYSTEM_DelayMs(1);
            continue;
        }
        if (err != 0) return HAL_I2C_ERROR;

        uint8_t received = Wire.requestFrom((uint8_t)addr, (uint8_t)len, (uint8_t)true);
        if (received != len) {
            attempt++;
            HAL_SYSTEM_DelayMs(1);
            continue;
        }
        for (uint8_t i = 0; i < len; i++) {
            buf[i] = Wire.read();
        }
        return HAL_I2C_OK;
    }
    return HAL_I2C_NACK;
}

HAL_I2C_Status HAL_I2C_WriteByte(uint8_t addr, uint8_t reg, uint8_t data) {
    return HAL_I2C_Write(addr, reg, &data, 1);
}

HAL_I2C_Status HAL_I2C_ReadByte(uint8_t addr, uint8_t reg, uint8_t* data) {
    return HAL_I2C_Read(addr, reg, data, 1);
}

bool HAL_I2C_DevicePresent(uint8_t addr) {
    Wire.beginTransmission(addr);
    uint8_t err = Wire.endTransmission(true);
    return (err == 0);
}

// ── HAL_I2C TESTS ────────────────────────────────────────────

static void Test_I2C_DevicePresent(void) {
    bool present = HAL_I2C_DevicePresent(I2C_ADDR_MPU9250);
    Serial.printf("  [I2C]    TEST 1 — DevicePresent(0x68): %s\n",
                  present ? "PASS" : "FAIL (MPU9250 not found — check wiring)");
}

static void Test_I2C_WhoAmI(void) {
    uint8_t who = 0;
    HAL_I2C_Status st = HAL_I2C_ReadByte(I2C_ADDR_MPU9250, 0x75, &who);
    bool pass = (st == HAL_I2C_OK) && (who == 0x71);
    Serial.printf("  [I2C]    TEST 2 — WHO_AM_I=0x%02X (expect 0x71): %s\n",
                  who, pass ? "PASS" : "FAIL");
}

/**
 * [BUG-9 FIX] Changed probe address from 0x00 (I2C General Call — may be
 * ACK'd by devices) to 0x7F (reserved address, should never ACK).
 */
static void Test_I2C_InvalidAddress(void) {
    bool present = HAL_I2C_DevicePresent(0x7F);
    bool pass = !present;
    Serial.printf("  [I2C]    TEST 3 — DevicePresent(0x7F)=false: %s\n",
                  pass ? "PASS" : "FAIL (unexpected ACK on reserved addr 0x7F)");
}

static void Test_I2C_WriteReadBack(void) {
    uint8_t original = 0;
    HAL_I2C_ReadByte(I2C_ADDR_MPU9250, 0x1B, &original);

    uint8_t writeVal = 0x08;
    HAL_I2C_Status wst = HAL_I2C_WriteByte(I2C_ADDR_MPU9250, 0x1B, writeVal);
    HAL_SYSTEM_DelayMs(5);

    uint8_t readBack = 0;
    HAL_I2C_Status rst = HAL_I2C_ReadByte(I2C_ADDR_MPU9250, 0x1B, &readBack);

    // Restore original
    HAL_I2C_WriteByte(I2C_ADDR_MPU9250, 0x1B, original);

    bool pass = (wst == HAL_I2C_OK) && (rst == HAL_I2C_OK) && (readBack == writeVal);
    Serial.printf("  [I2C]    TEST 4 — Write/Readback reg 0x1B (0x%02X): %s\n",
                  readBack, pass ? "PASS" : "FAIL");
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  MODULE 3 — HAL_UART
// ════════════════════════════════════════════════════════════
// ============================================================

// ── Ring buffer for CAM UART RX ──────────────────────────────
typedef struct {
    uint8_t  buf[UART_CAM_RX_BUFFER_SIZE];
    uint16_t head;   // write index
    uint16_t tail;   // read index
    bool     overflow;
} RingBuffer_t;

static RingBuffer_t s_cam_rb = { {0}, 0, 0, false };

static HAL_UART_Status s_uart_cam_status  = HAL_UART_OK;
static HAL_UART_Status s_uart_nano_status = HAL_UART_OK;

// ── Ring buffer helpers ──────────────────────────────────────

static void rb_push(RingBuffer_t* rb, uint8_t byte) {
    uint16_t next_head = (rb->head + 1) % UART_CAM_RX_BUFFER_SIZE;
    if (next_head == rb->tail) {
        rb->overflow = true;
        return;
    }
    rb->buf[rb->head] = byte;
    rb->head = next_head;
}

/**
 * [BUG-8 NOTE] rb_pop returns 0 on empty buffer — indistinguishable from
 * a valid 0x00 data byte. CONTRACT: callers MUST call rb_available() / 
 * HAL_UART_BytesAvailable() before calling rb_pop() / HAL_UART_ReadByte().
 * This is an architectural limitation of the current API; a future fix should
 * return int16_t (-1 on empty).
 */
static uint8_t rb_pop(RingBuffer_t* rb) {
    if (rb->head == rb->tail) return 0;
    uint8_t val = rb->buf[rb->tail];
    rb->tail = (rb->tail + 1) % UART_CAM_RX_BUFFER_SIZE;
    return val;
}

static bool rb_available(const RingBuffer_t* rb) {
    return rb->head != rb->tail;
}

