Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
static void rb_flush(RingBuffer_t* rb) {
    rb->head     = 0;
    rb->tail     = 0;
    rb->overflow = false;
}

static void HAL_UART_ServiceCamRx(void) {
    while (Serial1.available()) {
        uint8_t b = (uint8_t)Serial1.read();
        rb_push(&s_cam_rb, b);
    }
    if (s_cam_rb.overflow) {
        s_uart_cam_status = HAL_UART_OVERFLOW;
    }
}

/**
 * [BUG-7 FIX] For UART_PORT_NANO, UART_NANO_RX_PIN is -1 (TX-only).
 * Passing -1 directly to Serial2.begin() casts to a large GPIO number on
 * some core versions. Use UART_PIN_NO_CHANGE (-1 defined by Arduino ESP32)
 * explicitly, or cast to int to preserve sign.
 */
void HAL_UART_Init(UART_Port port) {
    switch (port) {
        case UART_PORT_DEBUG:
            Serial.begin(UART_DEBUG_BAUD);
            break;

        case UART_PORT_CAM:
            Serial1.begin(UART_CAM_BAUD, SERIAL_8N1,
                          UART_CAM_RX_PIN, UART_CAM_TX_PIN);
            rb_flush(&s_cam_rb);
            s_uart_cam_status = HAL_UART_OK;
            break;

        case UART_PORT_NANO:
            // TX-only: pass -1 explicitly for RX pin (UART_PIN_NO_CHANGE)
            Serial2.begin(UART_NANO_BAUD, SERIAL_8N1,
                          (int)UART_NANO_RX_PIN,   // -1 = no RX pin
                          UART_NANO_TX_PIN);
            s_uart_nano_status = HAL_UART_OK;
            break;

        default:
            break;
    }
}

void HAL_UART_SendBytes(UART_Port port, const uint8_t* data, uint8_t len) {
    if (data == NULL) return;

    switch (port) {
        case UART_PORT_DEBUG: Serial.write(const_cast<uint8_t*>(data), len);  break;
        case UART_PORT_CAM:   Serial1.write(const_cast<uint8_t*>(data), len); break;
        case UART_PORT_NANO:  Serial2.write(const_cast<uint8_t*>(data), len); break;
        default: break;
    }
}

bool HAL_UART_BytesAvailable(UART_Port port) {
    switch (port) {
        case UART_PORT_CAM:
            HAL_UART_ServiceCamRx();
            return rb_available(&s_cam_rb);
        case UART_PORT_DEBUG:
            return (Serial.available() > 0);
        case UART_PORT_NANO:
            return false;  // TX-only
        default:
            return false;
    }
}

uint8_t HAL_UART_ReadByte(UART_Port port) {
    switch (port) {
        case UART_PORT_CAM:
            HAL_UART_ServiceCamRx();
            return rb_pop(&s_cam_rb);
        case UART_PORT_DEBUG:
            return (Serial.available() > 0) ? (uint8_t)Serial.read() : 0;
        case UART_PORT_NANO:  // TX-only — intentional
        default:
            return 0;
    }
}

void HAL_UART_FlushRx(UART_Port port) {
    switch (port) {
        case UART_PORT_CAM:
            while (Serial1.available()) Serial1.read();
            rb_flush(&s_cam_rb);
            s_uart_cam_status = HAL_UART_OK;
            break;
        case UART_PORT_DEBUG:
            while (Serial.available()) Serial.read();
            break;
        default:
            break;
    }
}

HAL_UART_Status HAL_UART_GetStatus(UART_Port port) {
    switch (port) {
        case UART_PORT_CAM:  return s_uart_cam_status;
        case UART_PORT_NANO: return s_uart_nano_status;
        default:             return HAL_UART_OK;
    }
}

// ── HAL_UART TESTS ────────────────────────────────────────────

static void Test_UART_Init(void) {
    bool pass = true;
    Serial.printf("  [UART]   TEST 1 — Init both ports (no crash): %s\n",
                  pass ? "PASS" : "FAIL");
}

static void Test_UART_SendBytes(void) {
    const uint8_t frame[17] = {
        0xAA, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77,
        0x88, 0x99, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF, 0x55
    };
    HAL_UART_SendBytes(UART_PORT_CAM, frame, 17);
    bool pass = true;
    Serial.printf("  [UART]   TEST 2 — SendBytes 17B on CAM: %s (OBSERVE: verify with LA/CAM echo)\n",
                  pass ? "PASS" : "FAIL");
}

static void Test_UART_BytesAvailable(void) {
    HAL_UART_FlushRx(UART_PORT_CAM);
    bool avail = HAL_UART_BytesAvailable(UART_PORT_CAM);
    bool pass  = !avail;
    Serial.printf("  [UART]   TEST 3 — BytesAvailable after flush=false: %s\n",
                  pass ? "PASS" : "FAIL");
}

static void Test_UART_FlushRx(void) {
    for (uint8_t i = 0; i < 10; i++) {
        rb_push(&s_cam_rb, i);
    }
    HAL_UART_FlushRx(UART_PORT_CAM);
    bool pass = !rb_available(&s_cam_rb);
    Serial.printf("  [UART]   TEST 4 — FlushRx clears buffer: %s\n",
                  pass ? "PASS" : "FAIL");
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  MODULE 4 — HAL_ADC
// ════════════════════════════════════════════════════════════
// ============================================================

static bool           s_adc_initialized = false;
static HAL_ADC_Status s_adc_status      = HAL_ADC_OK;

void HAL_ADC_Init(void) {
    adc1_config_width(ADC_WIDTH_BIT_12);
    adc1_config_channel_atten(ADC1_CHANNEL_0, ADC_ATTEN_DB_11);

    s_adc_initialized = true;
    s_adc_status      = HAL_ADC_OK;
}

/**
 * [BUG-6 NOTE] sum overflow analysis:
 *   max_sum = ADC_OVERSAMPLE_COUNT * 4095 = 16 * 4095 = 65520
 *   uint32_t max = 4,294,967,295 — safe by a large margin.
 */
uint16_t HAL_ADC_ReadRaw(ADC_Channel ch) {
    if (ch != ADC_CH_BATTERY) return 0;

    uint32_t sum = 0;
    for (uint8_t i = 0; i < ADC_OVERSAMPLE_COUNT; i++) {
        sum += (uint32_t)adc1_get_raw((adc1_channel_t)ch);
    }
    return (uint16_t)(sum / ADC_OVERSAMPLE_COUNT);
}

float HAL_ADC_ReadMillivolts(ADC_Channel ch) {
    uint16_t raw = HAL_ADC_ReadRaw(ch);
    float    mv  = ((float)raw / 4096.0f) * ADC_VREF_MV + ADC_CALIBRATION_OFFSET_MV;
    return mv;
}

float HAL_ADC_ReadBatteryVoltage(void) {
    float mv_at_pin  = HAL_ADC_ReadMillivolts(ADC_CH_BATTERY);
    float battery_mv = mv_at_pin / ADC_DIVIDER_RATIO;
    return battery_mv / 1000.0f;
}

HAL_ADC_Status HAL_ADC_GetStatus(void) {
    if (!s_adc_initialized) return HAL_ADC_ERROR;
    return s_adc_status;
}

// ── HAL_ADC TESTS ─────────────────────────────────────────────

/**
 * [BUG-3 FIX] Changed (raw < 4095) to (raw <= 4095). A reading of exactly
 * 4095 is a valid ADC code (full-scale), not necessarily stuck. Stuck-at-max
 * is indistinguishable without a known input voltage, so we accept 4095 here
 * and rely on the voltage plausibility test (TEST 3) to catch rail-clamp.
 */
static void Test_ADC_RawRange(void) {
    uint16_t raw  = HAL_ADC_ReadRaw(ADC_CH_BATTERY);
    bool     pass = (raw > 0) && (raw <= 4095);
    Serial.printf("  [ADC]    TEST 1 — ReadRaw=%u (not stuck at 0): %s\n",
                  raw, pass ? "PASS" : "FAIL");
}

static void Test_ADC_Millivolts(void) {
    float mv   = HAL_ADC_ReadMillivolts(ADC_CH_BATTERY);
    bool  pass = (mv >= 3200.0f) && (mv <= 3400.0f);
    Serial.printf("  [ADC]    TEST 2 — ReadMillivolts=%.1fmV (3300+-100): %s\n",
                  mv, pass ? "PASS" : "FAIL (verify 3.3V on GPIO36)");
}

/**
 * [BUG-4 FIX] Replaced magic numbers with named constants from header.
 */
static void Test_ADC_BatteryVoltage(void) {
    float vbat = HAL_ADC_ReadBatteryVoltage();
    bool  pass = (vbat >= ADC_BATTERY_VOLTAGE_MIN_V) &&
                 (vbat <= ADC_BATTERY_VOLTAGE_MAX_V);
    Serial.printf("  [ADC]    TEST 3 — BatteryVoltage=%.3fV (%.1f-%.1fV range): %s\n",
                  vbat,
                  ADC_BATTERY_VOLTAGE_MIN_V,
                  ADC_BATTERY_VOLTAGE_MAX_V,
                  pass ? "PASS" : "FAIL");
}

