Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
static void Test_ADC_GetStatus(void) {
    HAL_ADC_Status st   = HAL_ADC_GetStatus();
    bool           pass = (st == HAL_ADC_OK);
    Serial.printf("  [ADC]    TEST 4 — GetStatus: %s\n",
                  pass ? "PASS" : "FAIL");
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  MODULE 5 — HAL_LEDC
// ════════════════════════════════════════════════════════════
// ============================================================

static bool            s_ledc_initialized = false;
static HAL_LEDC_Status s_ledc_status      = HAL_LEDC_OK;

typedef struct {
    uint8_t pwm_pin;
    uint8_t dir_pin;
    uint8_t ledc_ch;
} MotorHW_t;

static const MotorHW_t k_motors[2] = {
    { LEDC_MOTOR_A_PWM_PIN, LEDC_MOTOR_A_DIR_PIN, LEDC_MOTOR_A_CHANNEL },
    { LEDC_MOTOR_B_PWM_PIN, LEDC_MOTOR_B_DIR_PIN, LEDC_MOTOR_B_CHANNEL }
};

void HAL_LEDC_Init(void) {
    for (uint8_t i = 0; i < 2; i++) {
        ledcSetup(k_motors[i].ledc_ch,
                  LEDC_PWM_FREQ_HZ,
                  LEDC_PWM_RESOLUTION_BITS);
        ledcAttachPin(k_motors[i].pwm_pin, k_motors[i].ledc_ch);

        pinMode(k_motors[i].dir_pin, OUTPUT);
        digitalWrite(k_motors[i].dir_pin, LOW);

        ledcWrite(k_motors[i].ledc_ch, LEDC_PWM_MIN_DUTY);
    }

    s_ledc_initialized = true;
    s_ledc_status      = HAL_LEDC_OK;
}

void HAL_LEDC_SetDuty(LEDC_Channel ch, uint8_t duty) {
    if ((uint8_t)ch >= 2) return;

    uint8_t effective_duty = duty;
    if (effective_duty > (uint8_t)LEDC_PWM_MIN_DUTY &&
        effective_duty < (uint8_t)LEDC_MOTOR_DEADBAND) {
        effective_duty = (uint8_t)LEDC_MOTOR_DEADBAND;
    }

    ledcWrite(k_motors[(uint8_t)ch].ledc_ch, effective_duty);
}

void HAL_LEDC_SetDirection(LEDC_Channel ch, Motor_Direction dir) {
    if ((uint8_t)ch >= 2) return;

    switch (dir) {
        case MOTOR_DIR_FORWARD:
            digitalWrite(k_motors[(uint8_t)ch].dir_pin, HIGH);
            break;
        case MOTOR_DIR_BACKWARD:
            digitalWrite(k_motors[(uint8_t)ch].dir_pin, LOW);
            break;
        case MOTOR_DIR_BRAKE:
            digitalWrite(k_motors[(uint8_t)ch].dir_pin, LOW);
            ledcWrite(k_motors[(uint8_t)ch].ledc_ch, LEDC_PWM_MIN_DUTY);
            break;
        default:
            break;
    }
}

void HAL_LEDC_Stop(LEDC_Channel ch) {
    if ((uint8_t)ch >= 2) return;
    ledcWrite(k_motors[(uint8_t)ch].ledc_ch, LEDC_PWM_MIN_DUTY);
    digitalWrite(k_motors[(uint8_t)ch].dir_pin, LOW);
}

void HAL_LEDC_StopAll(void) {
    HAL_LEDC_Stop(LEDC_MOTOR_A);
    HAL_LEDC_Stop(LEDC_MOTOR_B);
}

HAL_LEDC_Status HAL_LEDC_GetStatus(void) {
    if (!s_ledc_initialized) return HAL_LEDC_ERROR;
    return s_ledc_status;
}

// ── HAL_LEDC TESTS ────────────────────────────────────────────

static void Test_LEDC_Init(void) {
    bool pass = (HAL_LEDC_GetStatus() == HAL_LEDC_OK);
    Serial.printf("  [LEDC]   TEST 1 — Init (no crash): %s\n",
                  pass ? "PASS" : "FAIL");
}

/**
 * [BUG-5 FIX] Tests 2–4 are observation-only (no automated assertion
 * possible without scope/LA). Prefixed with OBSERVE to distinguish from
 * assertion-based tests. pass=true is kept as a "no crash" assertion.
 */
static void Test_LEDC_FullDuty(void) {
    HAL_LEDC_SetDirection(LEDC_MOTOR_A, MOTOR_DIR_FORWARD);
    HAL_LEDC_SetDuty(LEDC_MOTOR_A, LEDC_PWM_MAX_DUTY);
    HAL_SYSTEM_DelayMs(500);
    bool no_crash = true;
    Serial.printf("  [LEDC]   TEST 2 — OBSERVE: SetDuty(A,255) 500ms: no_crash=%s"
                  " | MANUAL: verify GPIO12 ~1kHz 100%% duty\n",
                  no_crash ? "PASS" : "FAIL");
    HAL_LEDC_Stop(LEDC_MOTOR_A);
}

static void Test_LEDC_ZeroDuty(void) {
    HAL_LEDC_SetDuty(LEDC_MOTOR_A, LEDC_PWM_MIN_DUTY);
    HAL_SYSTEM_DelayMs(100);
    bool no_crash = true;
    Serial.printf("  [LEDC]   TEST 3 — OBSERVE: SetDuty(A,0): no_crash=%s"
                  " | MANUAL: verify GPIO12=0V\n",
                  no_crash ? "PASS" : "FAIL");
}

static void Test_LEDC_Deadband(void) {
    HAL_LEDC_SetDirection(LEDC_MOTOR_A, MOTOR_DIR_FORWARD);
    HAL_LEDC_SetDuty(LEDC_MOTOR_A, 10);
    HAL_SYSTEM_DelayMs(200);
    bool no_crash = true;
    Serial.printf("  [LEDC]   TEST 4 — OBSERVE: Deadband clamp duty=10->%d: no_crash=%s"
                  " | MANUAL: verify scope\n",
                  LEDC_MOTOR_DEADBAND, no_crash ? "PASS" : "FAIL");
    HAL_LEDC_Stop(LEDC_MOTOR_A);
}

static void Test_LEDC_StopAll(void) {
    HAL_LEDC_SetDuty(LEDC_MOTOR_A, 200);
    HAL_LEDC_SetDuty(LEDC_MOTOR_B, 150);
    HAL_SYSTEM_DelayMs(200);
    HAL_LEDC_StopAll();
    bool pass = (HAL_LEDC_GetStatus() == HAL_LEDC_OK);
    Serial.printf("  [LEDC]   TEST 5 — StopAll both motors: %s"
                  " | MANUAL: verify GPIO12+14=0V\n",
                  pass ? "PASS" : "FAIL");
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  UNIFIED TEST RUNNER
// ════════════════════════════════════════════════════════════
// ============================================================

/**
 * @brief  Run all 21 HAL tests across all 5 modules.
 *         [BUG-10 FIX] Updated count from "18" to "21"
 *         (4 SYSTEM + 4 I2C + 4 UART + 4 ADC + 5 LEDC = 21).
 *         Call once from setup() after all HAL_x_Init() calls.
 *         Output goes to Serial (UART_PORT_DEBUG) at 115200 baud.
 */
void RunAllTests(void) {
    Serial.println(F("\n============================================================"));
    Serial.println(F("  MT-1 HAL TEST SUITE — Waiter Robot ESP32_MAIN"));
    Serial.println(F("  QA AUDIT v1.1 — 21 tests / 5 modules"));
    Serial.println(F("============================================================"));

    Serial.println(F("\n--- MODULE 1: HAL_SYSTEM ---"));
    Test_SYSTEM_TickIncrements();
    HAL_SYSTEM_FeedWatchdog();
    Test_SYSTEM_DelayAccuracy();
    HAL_SYSTEM_FeedWatchdog();
    Test_SYSTEM_WatchdogFeed();
    HAL_SYSTEM_FeedWatchdog();
    Test_SYSTEM_GetStatus();
    HAL_SYSTEM_FeedWatchdog();

    Serial.println(F("\n--- MODULE 2: HAL_I2C ---"));
    Test_I2C_DevicePresent();
    HAL_SYSTEM_FeedWatchdog();
    Test_I2C_WhoAmI();
    HAL_SYSTEM_FeedWatchdog();
    Test_I2C_InvalidAddress();
    HAL_SYSTEM_FeedWatchdog();
    Test_I2C_WriteReadBack();
    HAL_SYSTEM_FeedWatchdog();

