Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
    Serial.println(F("\n--- MODULE 3: HAL_UART ---"));
    Test_UART_Init();
    HAL_SYSTEM_FeedWatchdog();
    Test_UART_SendBytes();
    HAL_SYSTEM_FeedWatchdog();
    Test_UART_BytesAvailable();
    HAL_SYSTEM_FeedWatchdog();
    Test_UART_FlushRx();
    HAL_SYSTEM_FeedWatchdog();

    Serial.println(F("\n--- MODULE 4: HAL_ADC ---"));
    Test_ADC_RawRange();
    HAL_SYSTEM_FeedWatchdog();
    Test_ADC_Millivolts();
    HAL_SYSTEM_FeedWatchdog();
    Test_ADC_BatteryVoltage();
    HAL_SYSTEM_FeedWatchdog();
    Test_ADC_GetStatus();
    HAL_SYSTEM_FeedWatchdog();

    Serial.println(F("\n--- MODULE 5: HAL_LEDC ---"));
    Test_LEDC_Init();
    HAL_SYSTEM_FeedWatchdog();
    Test_LEDC_FullDuty();
    HAL_SYSTEM_FeedWatchdog();
    Test_LEDC_ZeroDuty();
    HAL_SYSTEM_FeedWatchdog();
    Test_LEDC_Deadband();
    HAL_SYSTEM_FeedWatchdog();
    Test_LEDC_StopAll();
    HAL_SYSTEM_FeedWatchdog();

    Serial.println(F("\n============================================================"));
    Serial.println(F("  TEST SUITE COMPLETE"));
    Serial.println(F("  Legend: PASS=automated | OBSERVE=requires scope/LA"));
    Serial.println(F("============================================================\n"));
}
// ============================================================
// DRV_MT2.cpp — Monolithic Driver Layer Implementation
// Project  : Waiter Robot — ESP32_MAIN
// Board    : ESP32 WROOM-32 38-pin
// Compiler : Arduino IDE (ESP32 Arduino Core ≥ 2.0)
// Depends  : HAL_MT1.h + HAL_MT1.cpp
//
// REVIEW FIXES APPLIED:
//   [C3] enc_isr_*: replaced millis() with esp_timer_get_time() (ISR-safe)
//   [C4] DRV_HCSR04_ObstacleDetected: uses cached s_hcsr04_distance_cm,
//        no longer triggers a second blocking measurement
//   [C5] DRV_AK8963_Update: reads 7 bytes to include ST2 and release data latch
//   [W1] DRV_LINE_Update: self-assignment replaced with an explicit comment
//   [W4] DRV_L298N_TurnDegrees: now returns bool (true=success, false=timeout)
//        with Serial warning on timeout; signature updated in header
//   [W5] Raw 3.14159f literals replaced with MPU9250_PI_F
//   [W6] DRV_BATTERY_Update: removed direct call to DRV_L298N_EmergencyBrake();
//        upper layer must observe is_very_low and act — cross-driver call removed
//   [W7] DRV_ENCODER_Reset: now resets s_enc_last_time to prevent RPM spike
//   [S2] MPU9250 bypass-enable magic number replaced with MPU9250_BYPASS_EN_BIT
//   [S4] tcs_count_pulses: feeds watchdog inside pulse-counting window
// ============================================================

// DRV_MT2 content included via ESP32_INTEGRATED.h
#include <math.h>
#include <esp_timer.h>   // FIX [C3]: ISR-safe time source

// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 1 — MPU9250 IMU
// ════════════════════════════════════════════════════════════
// ============================================================

static bool    s_mpu_initialized = false;
static float   s_pitch           = 0.0f;
static float   s_roll            = 0.0f;
static float   s_heading_gyro    = 0.0f;
static uint32_t s_mpu_last_tick  = 0;

/**
 * @brief  Initialise MPU9250: wake, verify WHO_AM_I, configure
 *         sample rate, gyro/accel ranges, enable I2C bypass.
 * @return MPU_OK on success, MPU_FAULT on wrong device ID
 */
MPU_Status DRV_MPU9250_Init(void) {
    // Wake device — clear sleep bit
    if (HAL_I2C_WriteByte(MPU9250_I2C_ADDR, MPU9250_PWR_MGMT_1_REG, 0x00) != HAL_I2C_OK) {
        return MPU_FAULT;
    }
    HAL_SYSTEM_DelayMs(100);

    // Verify WHO_AM_I
    uint8_t who = 0;
    if (HAL_I2C_ReadByte(MPU9250_I2C_ADDR, MPU9250_WHO_AM_I_REG, &who) != HAL_I2C_OK) {
        return MPU_FAULT;
    }
    if (who != MPU9250_WHO_AM_I_VAL) {
        return MPU_FAULT;
    }

    // Sample rate divider: 1kHz / (1 + SMPLRT_DIV) — set 0 for 1kHz
    if (HAL_I2C_WriteByte(MPU9250_I2C_ADDR, MPU9250_SMPLRT_DIV_REG, 0x00) != HAL_I2C_OK) {
        return MPU_FAULT;
    }

    // DLPF config = 3 → 41Hz bandwidth, reduces vibration noise
    if (HAL_I2C_WriteByte(MPU9250_I2C_ADDR, MPU9250_CONFIG_REG, 0x03) != HAL_I2C_OK) {
        return MPU_FAULT;
    }

    // Gyro config: FS_SEL=0 → ±250°/s (bits [4:3] = 00)
    if (HAL_I2C_WriteByte(MPU9250_I2C_ADDR, MPU9250_GYRO_CONFIG_REG, 0x00) != HAL_I2C_OK) {
        return MPU_FAULT;
    }

    // Accel config: AFS_SEL=0 → ±2g (bits [4:3] = 00)
    if (HAL_I2C_WriteByte(MPU9250_I2C_ADDR, MPU9250_ACCEL_CONFIG_REG, 0x00) != HAL_I2C_OK) {
        return MPU_FAULT;
    }

    // Enable I2C bypass so AK8963 is directly accessible on the bus
    // FIX [S2]: was raw 0x02, now uses named constant MPU9250_BYPASS_EN_BIT
    if (HAL_I2C_WriteByte(MPU9250_I2C_ADDR, MPU9250_INT_PIN_CFG_REG, MPU9250_BYPASS_EN_BIT) != HAL_I2C_OK) {
        return MPU_FAULT;
    }

    s_mpu_initialized = true;
    s_mpu_last_tick   = HAL_SYSTEM_GetTick();
    return MPU_OK;
}

/**
 * @brief  Read 14 raw bytes (accel + temp + gyro), apply offsets,
 *         scale to physical units, run complementary filter.
 *         Call at MPU9250_UPDATE_RATE_HZ (100Hz = every 10ms).
 * @return MPU_OK, MPU_NOT_INIT, or MPU_FAULT
 */
MPU_Status DRV_MPU9250_Update(void) {
    if (!s_mpu_initialized) return MPU_NOT_INIT;

    uint8_t raw[14] = {0};
    if (HAL_I2C_Read(MPU9250_I2C_ADDR, MPU9250_ACCEL_XOUT_H, raw, 14) != HAL_I2C_OK) {
        return MPU_FAULT;
    }

    // Combine high/low bytes — big-endian two's complement
    int16_t ax_raw = (int16_t)((raw[0]  << 8) | raw[1]);
    int16_t ay_raw = (int16_t)((raw[2]  << 8) | raw[3]);
    int16_t az_raw = (int16_t)((raw[4]  << 8) | raw[5]);
    // raw[6] raw[7] = temperature — unused here
    int16_t gx_raw = (int16_t)((raw[8]  << 8) | raw[9]);
    int16_t gy_raw = (int16_t)((raw[10] << 8) | raw[11]);
    int16_t gz_raw = (int16_t)((raw[12] << 8) | raw[13]);

    // Apply calibration offsets then scale
    float ax = ((float)ax_raw - MPU9250_ACCEL_OFFSET_X) / MPU9250_ACCEL_SCALE;
    float ay = ((float)ay_raw - MPU9250_ACCEL_OFFSET_Y) / MPU9250_ACCEL_SCALE;
    float az = ((float)az_raw - MPU9250_ACCEL_OFFSET_Z) / MPU9250_ACCEL_SCALE;
    float gx = ((float)gx_raw - MPU9250_GYRO_OFFSET_X)  / MPU9250_GYRO_SCALE;  // °/s
    float gy = ((float)gy_raw - MPU9250_GYRO_OFFSET_Y)  / MPU9250_GYRO_SCALE;
    float gz = ((float)gz_raw - MPU9250_GYRO_OFFSET_Z)  / MPU9250_GYRO_SCALE;

    // Compute dt in seconds
    uint32_t now = HAL_SYSTEM_GetTick();
    float    dt  = (float)(now - s_mpu_last_tick) / 1000.0f;
    s_mpu_last_tick = now;
    if (dt <= 0.0f || dt > 1.0f) dt = 0.01f; // guard against bad dt

    // Accel angles (degrees)
    // FIX [W5]: use MPU9250_PI_F instead of raw 3.14159f
    float accel_angle_pitch = atan2f(ay, az) * (180.0f / MPU9250_PI_F);
    float accel_angle_roll  = atan2f(ax, az) * (180.0f / MPU9250_PI_F);

    // Complementary filter
    s_pitch = MPU9250_COMP_FILTER_ALPHA * (s_pitch + gx * dt)
            + (1.0f - MPU9250_COMP_FILTER_ALPHA) * accel_angle_pitch;
    s_roll  = MPU9250_COMP_FILTER_ALPHA * (s_roll  + gy * dt)
            + (1.0f - MPU9250_COMP_FILTER_ALPHA) * accel_angle_roll;

    // Yaw — gyro integration only (no accel correction for yaw)
    s_heading_gyro += gz * dt;

