Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
    // Normalize heading 0–360
    // FIX [S5]: use fmodf to avoid infinite loop on float divergence
    s_heading_gyro = fmodf(s_heading_gyro, 360.0f);
    if (s_heading_gyro < 0.0f) s_heading_gyro += 360.0f;

    return MPU_OK;
}

/** @return Current gyro-integrated heading in degrees (0–360) */
float DRV_MPU9250_GetHeading(void) { return s_heading_gyro; }

/** @return Current pitch angle in degrees */
float DRV_MPU9250_GetPitch(void)   { return s_pitch; }

/** @return Current roll angle in degrees */
float DRV_MPU9250_GetRoll(void)    { return s_roll; }

/**
 * @brief  Return complete IMU snapshot.
 * @return IMUData struct with heading, pitch, roll, status
 */
IMUData DRV_MPU9250_GetData(void) {
    IMUData d;
    d.heading_deg     = s_heading_gyro;
    d.pitch_deg       = s_pitch;
    d.roll_deg        = s_roll;
    d.mag_heading_deg = DRV_AK8963_GetHeading();
    d.status          = s_mpu_initialized ? MPU_OK : MPU_NOT_INIT;
    return d;
}

/**
 * @brief  Collect MPU9250_CALIB_SAMPLES gyro readings at rest.
 *         Prints offset values to Serial — paste into config header.
 *         Robot MUST be stationary during this call (~5 seconds).
 */
void DRV_MPU9250_CalibrateGyro(void) {
    if (!s_mpu_initialized) return;

    float sum_x = 0.0f, sum_y = 0.0f, sum_z = 0.0f;
    uint8_t raw[6] = {0};

    for (uint16_t i = 0; i < MPU9250_CALIB_SAMPLES; i++) {
        if (HAL_I2C_Read(MPU9250_I2C_ADDR, MPU9250_GYRO_XOUT_H, raw, 6) == HAL_I2C_OK) {
            int16_t gx = (int16_t)((raw[0] << 8) | raw[1]);
            int16_t gy = (int16_t)((raw[2] << 8) | raw[3]);
            int16_t gz = (int16_t)((raw[4] << 8) | raw[5]);
            sum_x += (float)gx;
            sum_y += (float)gy;
            sum_z += (float)gz;
        }
        HAL_SYSTEM_DelayMs(10);
        HAL_SYSTEM_FeedWatchdog();
    }

    float offset_x = sum_x / (float)MPU9250_CALIB_SAMPLES;
    float offset_y = sum_y / (float)MPU9250_CALIB_SAMPLES;
    float offset_z = sum_z / (float)MPU9250_CALIB_SAMPLES;

    Serial.println(F("[CALIB] Paste these into DRV_MT2.h:"));
    Serial.printf("#define MPU9250_GYRO_OFFSET_X  %.4ff\n", offset_x);
    Serial.printf("#define MPU9250_GYRO_OFFSET_Y  %.4ff\n", offset_y);
    Serial.printf("#define MPU9250_GYRO_OFFSET_Z  %.4ff\n", offset_z);
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 2 — AK8963 MAGNETOMETER
// ════════════════════════════════════════════════════════════
// ============================================================

static bool  s_ak_initialized  = false;
static float s_mag_heading_deg = 0.0f;

/**
 * @brief  Initialise AK8963: verify WHO_AM_I, set 100Hz 16-bit mode.
 *         Requires MPU9250 I2C bypass already enabled.
 * @return AK_OK or AK_FAULT
 */
AK_Status DRV_AK8963_Init(void) {
    // Power-down first (required before mode change)
    if (HAL_I2C_WriteByte(AK8963_I2C_ADDR, AK8963_CNTL1_REG, 0x00) != HAL_I2C_OK) {
        return AK_FAULT;
    }
    HAL_SYSTEM_DelayMs(10);

    // Verify WHO_AM_I
    uint8_t who = 0;
    if (HAL_I2C_ReadByte(AK8963_I2C_ADDR, AK8963_WHO_AM_I_REG, &who) != HAL_I2C_OK) {
        return AK_FAULT;
    }
    if (who != AK8963_WHO_AM_I_VAL) {
        return AK_FAULT;
    }

    // Continuous measurement mode 2: 16-bit output, 100Hz
    if (HAL_I2C_WriteByte(AK8963_I2C_ADDR, AK8963_CNTL1_REG, AK8963_MODE_CONT_2) != HAL_I2C_OK) {
        return AK_FAULT;
    }
    HAL_SYSTEM_DelayMs(10);

    s_ak_initialized = true;
    return AK_OK;
}

/**
 * @brief  Poll DRDY bit in ST1; read 6 mag bytes + ST2 if ready.
 *         FIX [C5]: ST2 register (0x09) MUST be read after data bytes
 *         to release the AK8963 data register latch and allow the next
 *         sample to be captured. Omitting this read stalls continuous mode.
 *         Apply hard-iron correction, scale, compute heading.
 * @return AK_OK, AK_NOT_READY (no new data), or AK_FAULT
 */
AK_Status DRV_AK8963_Update(void) {
    if (!s_ak_initialized) return AK_FAULT;

    // Check data-ready bit (bit 0 of ST1)
    uint8_t st1 = 0;
    if (HAL_I2C_ReadByte(AK8963_I2C_ADDR, AK8963_ST1_REG, &st1) != HAL_I2C_OK) {
        return AK_FAULT;
    }
    if (!(st1 & 0x01)) {
        return AK_NOT_READY;  // no new sample yet
    }

    // FIX [C5]: Read 7 bytes: XL, XH, YL, YH, ZL, ZH, ST2 (little-endian)
    // ST2 must be read to release the data latch — byte is discarded.
    uint8_t raw[7] = {0};
    if (HAL_I2C_Read(AK8963_I2C_ADDR, AK8963_XOUT_L, raw, 7) != HAL_I2C_OK) {
        return AK_FAULT;
    }
    // raw[6] = ST2 — reading it releases the latch; value not used here

    int16_t mx_raw = (int16_t)((raw[1] << 8) | raw[0]);
    int16_t my_raw = (int16_t)((raw[3] << 8) | raw[2]);
    // int16_t mz_raw = unused for 2D heading

    // Apply hard-iron offsets and scale to μT
    float mx = ((float)mx_raw - AK8963_HARD_IRON_X) * AK8963_MAG_SCALE;
    float my = ((float)my_raw - AK8963_HARD_IRON_Y) * AK8963_MAG_SCALE;

    // Compute compass heading
    // FIX [W5]: use MPU9250_PI_F instead of raw 3.14159f
    float heading = atan2f(my, mx) * (180.0f / MPU9250_PI_F);
    heading += AK8963_DECLINATION_DEG;

    // FIX [S5]: use fmodf for heading normalization
    heading = fmodf(heading, 360.0f);
    if (heading < 0.0f) heading += 360.0f;

    s_mag_heading_deg = heading;
    return AK_OK;
}

/** @return Compass heading in degrees (0–360, north = 0) */
float DRV_AK8963_GetHeading(void) {
    return s_mag_heading_deg;
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 3 — TCS3200 COLOR SENSOR
// ════════════════════════════════════════════════════════════
// ============================================================

static uint32_t s_tcs_ch[4]    = {0, 0, 0, 0};  // R, G, B, Clear counts
static TCS_Color s_tcs_color   = TCS_UNKNOWN;

/**
 * @brief  Configure TCS3200 GPIO, apply output frequency scaling.
 * @return void
 */
void DRV_TCS3200_Init(void) {
    pinMode(TCS_S0_PIN,  OUTPUT);
    pinMode(TCS_S1_PIN,  OUTPUT);
    pinMode(TCS_S2_PIN,  OUTPUT);
    pinMode(TCS_S3_PIN,  OUTPUT);
    pinMode(TCS_OUT_PIN, INPUT);

    // Apply 20% output frequency scaling
    digitalWrite(TCS_S0_PIN, TCS_SCALE_S0_STATE);
    digitalWrite(TCS_S1_PIN, TCS_SCALE_S1_STATE);
}

/**
 * @brief  Helper: select photodiode filter and count pulses
 *         for TCS_PULSE_WINDOW_MS milliseconds.
 *         FIX [S4]: feeds watchdog during the counting window.
 * @param  s2  S2 state for filter select
 * @param  s3  S3 state for filter select
 * @return Pulse count in the measurement window
 */
static uint32_t tcs_count_pulses(uint8_t s2, uint8_t s3) {
    digitalWrite(TCS_S2_PIN, s2);
    digitalWrite(TCS_S3_PIN, s3);
    HAL_SYSTEM_DelayMs(2);  // settle time after filter switch

