Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
    uint32_t count    = 0;
    uint32_t deadline = HAL_SYSTEM_GetTick() + TCS_PULSE_WINDOW_MS;
    while (HAL_SYSTEM_GetTick() < deadline) {
        if (pulseIn(TCS_OUT_PIN, LOW, 5000UL) > 0) {
            count++;
        }
        // FIX [S4]: feed watchdog during 100ms blocking window
        HAL_SYSTEM_FeedWatchdog();
    }
    return count;
}

/**
 * @brief  Read all four color channels and classify the detected color.
 *         WARNING: BLOCKING ~450ms TOTAL. Do NOT call from main control loop.
 *         Call from a dedicated low-rate task or state machine step only.
 * @return void
 */
void DRV_TCS3200_Update(void) {
    // S2  S3  → Filter
    // L   L   → Red
    // H   H   → Green
    // L   H   → Blue
    // H   L   → Clear (no filter)
    s_tcs_ch[TCS_CH_RED]   = tcs_count_pulses(LOW,  LOW);
    s_tcs_ch[TCS_CH_GREEN] = tcs_count_pulses(HIGH, HIGH);
    s_tcs_ch[TCS_CH_BLUE]  = tcs_count_pulses(LOW,  HIGH);
    s_tcs_ch[TCS_CH_CLEAR] = tcs_count_pulses(HIGH, LOW);

    uint32_t r = s_tcs_ch[TCS_CH_RED];
    uint32_t g = s_tcs_ch[TCS_CH_GREEN];
    uint32_t b = s_tcs_ch[TCS_CH_BLUE];

    // Classify — compare against calibrated threshold table
    if (r < COLOR_BLACK_R_MAX && g < COLOR_BLACK_G_MAX && b < COLOR_BLACK_B_MAX) {
        s_tcs_color = TCS_BLACK;
    }
    else if (r > COLOR_WHITE_R_MIN && g > COLOR_WHITE_G_MIN && b > COLOR_WHITE_B_MIN) {
        s_tcs_color = TCS_WHITE;
    }
    else if (r >= COLOR_RED_R_MIN   && r <= COLOR_RED_R_MAX &&
             g <  COLOR_RED_G_MAX   && b <  COLOR_RED_B_MAX) {
        s_tcs_color = TCS_RED;
    }
    else if (r <  COLOR_GREEN_R_MAX &&
             g >= COLOR_GREEN_G_MIN && g <= COLOR_GREEN_G_MAX &&
             b <  COLOR_GREEN_B_MAX) {
        s_tcs_color = TCS_GREEN;
    }
    else if (r <  COLOR_BLUE_R_MAX  && g < COLOR_BLUE_G_MAX &&
             b >= COLOR_BLUE_B_MIN  && b <= COLOR_BLUE_B_MAX) {
        s_tcs_color = TCS_BLUE;
    }
    else {
        s_tcs_color = TCS_UNKNOWN;
    }
}

/** @return Last classified color */
TCS_Color DRV_TCS3200_GetColor(void) {
    return s_tcs_color;
}

/**
 * @brief  Return raw pulse count for a specific channel.
 * @param  ch  TCS_CH_RED, TCS_CH_GREEN, TCS_CH_BLUE, or TCS_CH_CLEAR
 * @return Pulse count from last Update()
 */
uint32_t DRV_TCS3200_GetChannel(TCS_Channel ch) {
    if ((uint8_t)ch >= 4) return 0;
    return s_tcs_ch[(uint8_t)ch];
}

/**
 * @brief  Check if current color matches the configured line color target.
 * @return true if color == LINE_COLOR_TARGET
 */
bool DRV_TCS3200_IsLineColor(void) {
    return (s_tcs_color == LINE_COLOR_TARGET);
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 4 — HC-SR04 ULTRASONIC
// ════════════════════════════════════════════════════════════
// ============================================================

static float       s_hcsr04_distance_cm = (float)HCSR04_MAX_DISTANCE_CM;
static HCSR_Status s_hcsr04_status      = HCSR_OK;

/**
 * @brief  Configure TRIG as output, ECHO as input.
 * @return void
 */
void DRV_HCSR04_Init(void) {
    pinMode(HCSR04_TRIG_PIN, OUTPUT);
    pinMode(HCSR04_ECHO_PIN, INPUT);
    digitalWrite(HCSR04_TRIG_PIN, LOW);
}

/**
 * @brief  Fire trigger pulse and measure echo duration.
 *         Blocking call bounded by HCSR04_TIMEOUT_US (25ms max).
 * @return Distance in cm, clamped to HCSR04_MIN–MAX range.
 *         Returns HCSR04_MAX_DISTANCE_CM on timeout or out-of-range.
 */
float DRV_HCSR04_GetDistance(void) {
    // Ensure TRIG is LOW before pulse
    digitalWrite(HCSR04_TRIG_PIN, LOW);
    delayMicroseconds(2);

    // Send 10μs trigger pulse
    digitalWrite(HCSR04_TRIG_PIN, HIGH);
    delayMicroseconds(HCSR04_TRIG_PULSE_US);
    digitalWrite(HCSR04_TRIG_PIN, LOW);

    // Measure echo duration (bounded by timeout)
    unsigned long duration = pulseIn(HCSR04_ECHO_PIN, HIGH, HCSR04_TIMEOUT_US);

    if (duration == 0) {
        s_hcsr04_status      = HCSR_TIMEOUT;
        s_hcsr04_distance_cm = (float)HCSR04_MAX_DISTANCE_CM;
        return s_hcsr04_distance_cm;
    }

    float dist = (float)duration * HCSR04_SOUND_SPEED_CM_US / 2.0f;

    if (dist > (float)HCSR04_MAX_DISTANCE_CM || dist < (float)HCSR04_MIN_DISTANCE_CM) {
        s_hcsr04_status      = HCSR_OUT_OF_RANGE;
        s_hcsr04_distance_cm = (float)HCSR04_MAX_DISTANCE_CM;
        return s_hcsr04_distance_cm;
    }

    s_hcsr04_status      = HCSR_OK;
    s_hcsr04_distance_cm = dist;
    return s_hcsr04_distance_cm;
}

/**
 * @brief  Returns true if the last measured distance is below obstacle threshold.
 *         FIX [C4]: Uses cached s_hcsr04_distance_cm — does NOT fire a new
 *         blocking measurement. Call DRV_HCSR04_GetDistance() first to refresh.
 *         FIX [BUG-06]: Implemented hysteresis using HCSR04_CLEAR_THRESHOLD_CM.
 *         Obstacle is SET when distance < OBSTACLE_THRESHOLD (15cm).
 *         Obstacle is CLEARED only when distance > CLEAR_THRESHOLD (20cm).
 *         This prevents rapid flag toggling at the boundary.
 * @return true = obstacle present, false = clear
 */
bool DRV_HCSR04_ObstacleDetected(void) {
    static bool s_obstacle_state = false;
    if (!s_obstacle_state) {
        // Not currently blocked — set flag only if clearly inside threshold
        if (s_hcsr04_distance_cm < HCSR04_OBSTACLE_THRESHOLD_CM) {
            s_obstacle_state = true;
        }
    } else {
        // Currently blocked — clear only when beyond hysteresis threshold
        if (s_hcsr04_distance_cm > HCSR04_CLEAR_THRESHOLD_CM) {
            s_obstacle_state = false;
        }
    }
    return s_obstacle_state;
}

/** @return Last HC-SR04 status code */
HCSR_Status DRV_HCSR04_GetStatus(void) {
    return s_hcsr04_status;
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 5 — LINE SENSOR ARRAY (TCRT5000 x5)
// ════════════════════════════════════════════════════════════
// ============================================================

static LineData s_line_data = {0, 0, false};

// Pin lookup table — index 0=S1(left) … 4=S5(right)
static const uint8_t k_line_pins[5] = {
    LINE_S1_PIN, LINE_S2_PIN, LINE_S3_PIN, LINE_S4_PIN, LINE_S5_PIN
};

/**
 * @brief  Configure all 5 line sensor pins as digital inputs.
 * @return void
 */
void DRV_LINE_Init(void) {
    for (uint8_t i = 0; i < 5; i++) {
        pinMode(k_line_pins[i], INPUT);
    }
}

/**
 * @brief  Read all 5 sensors, build bitmask, compute weighted error.
 *         Sensors are active-low (LINE_SENSOR_ACTIVE_STATE = LOW).
 *         Error = weighted center of mass of active sensors.
 *         FIX [BUG-02]: Non-adjacent sensor pairs (e.g. S1+S5 straddling the
 *         line) returned error=0, identical to centered. Now detected as ambiguous
 *         and the last known valid error is preserved instead, with line_lost=false
 *         so the upper layer can apply a hold strategy rather than a recovery.
 * @return void
 */
void DRV_LINE_Update(void) {
    uint8_t mask    = 0;
    int16_t sum     = 0;
    uint8_t count   = 0;

    // Sensor weights: S1=-2, S2=-1, S3=0, S4=+1, S5=+2
    static const int8_t k_weights[5] = {-2, -1, 0, 1, 2};

    for (uint8_t i = 0; i < 5; i++) {
        bool active = (digitalRead(k_line_pins[i]) == LINE_SENSOR_ACTIVE_STATE);
        if (active) {
            mask  |= (1 << i);
            sum   += k_weights[i];
            count++;
        }
    }

    s_line_data.bitmask   = mask;
    s_line_data.line_lost = (count == 0);

