Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
    if (count == 0) {
        // FIX [W1]: line lost — preserve last known error for recovery.
        // s_line_data.error is intentionally left unchanged here.
        // Upper layer is responsible for recovery action.
        return;
    }

    int8_t new_error = (int8_t)(sum / (int16_t)count);

    // FIX [BUG-02]: Detect non-adjacent active sensors (ambiguous straddle).
    //   Non-adjacent pairs produce the same centroid as a single sensor but
    //   represent a fundamentally different physical situation.
    //   Strategy: if active sensors are non-contiguous, preserve last error.
    //   Non-contiguous = gap exists in the bitmask between the first and last
    //   set bit (i.e. popcount of the span exceeds popcount of the mask).
    bool non_contiguous = false;
    if (count >= 2) {
        // Find lowest and highest set bit
        uint8_t lo = 0, hi = 4;
        for (uint8_t i = 0;     i < 5; i++) { if (mask & (1 << i)) { lo = i; break; } }
        for (uint8_t i = 4; (int8_t)i >= 0; i--) { if (mask & (1 << i)) { hi = i; break; } }
        uint8_t span = hi - lo + 1;
        if (span > count) {
            non_contiguous = true;
        }
    }

    if (!non_contiguous) {
        s_line_data.error = new_error;
    }
    // else: non-contiguous sensors — keep last valid error; upper layer holds course
}

/** @return Full LineData snapshot */
LineData DRV_LINE_GetData(void) {
    return s_line_data;
}

/** @return Line position error (-2 to +2) */
int8_t DRV_LINE_GetError(void) {
    return s_line_data.error;
}

/** @return true if all sensors are off (line lost) */
bool DRV_LINE_IsLost(void) {
    return s_line_data.line_lost;
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 6 — ENCODER (Hall effect / slotted disk)
// ════════════════════════════════════════════════════════════
// ============================================================

// Volatile — shared between ISR and main context
static volatile int32_t s_enc_left_ticks  = 0;
static volatile int32_t s_enc_right_ticks = 0;

// Non-volatile working copies — updated in DRV_ENCODER_Update
static EncoderData s_enc_data       = {0, 0, 0.0f, 0.0f, 0.0f, 0.0f};  // FIX [W3]
static int32_t     s_enc_last_left  = 0;
static int32_t     s_enc_last_right = 0;
static uint32_t    s_enc_last_time  = 0;

// FIX [C3]: Use uint32_t to store ms from esp_timer (not millis())
static volatile uint32_t s_enc_left_last_pulse_ms  = 0;
static volatile uint32_t s_enc_right_last_pulse_ms = 0;

/**
 * ISR — left encoder rising edge
 * FIX [C3]: millis() is NOT ISR-safe on ESP32 (acquires a mutex).
 *           Replaced with esp_timer_get_time() which is ISR-safe.
 */
static void IRAM_ATTR enc_isr_left(void) {
    s_enc_left_ticks++;
    s_enc_left_last_pulse_ms = (uint32_t)(esp_timer_get_time() / 1000ULL);
}

/** ISR — right encoder rising edge */
static void IRAM_ATTR enc_isr_right(void) {
    s_enc_right_ticks++;
    s_enc_right_last_pulse_ms = (uint32_t)(esp_timer_get_time() / 1000ULL);
}

/**
 * @brief  Attach rising-edge interrupts to both encoder pins.
 * @return void
 */
void DRV_ENCODER_Init(void) {
    pinMode(ENCODER_LEFT_PIN,  INPUT_PULLUP);
    pinMode(ENCODER_RIGHT_PIN, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(ENCODER_LEFT_PIN),  enc_isr_left,  RISING);
    attachInterrupt(digitalPinToInterrupt(ENCODER_RIGHT_PIN), enc_isr_right, RISING);
    s_enc_last_time = HAL_SYSTEM_GetTick();
}

/**
 * @brief  Compute RPM and distance from tick delta.
 *         Call every ENCODER_RPM_WINDOW_MS (100ms).
 * @return void
 */
void DRV_ENCODER_Update(void) {
    uint32_t now = HAL_SYSTEM_GetTick();
    uint32_t dt  = now - s_enc_last_time;
    if (dt == 0) return;

    // FIX [BUG-04]: Both volatile reads (ticks + last_pulse) consolidated into
    //   one atomic block. Previously a second noInterrupts() block at the end
    //   updated s_enc_data.left_ticks independently from left_now, so an ISR
    //   firing between the two blocks could leave left_ticks != left_now.
    //   Now one snapshot captures everything; s_enc_data.left_ticks is set
    //   directly from the consistent left_now value below.
    noInterrupts();
    int32_t  left_now              = s_enc_left_ticks;
    int32_t  right_now             = s_enc_right_ticks;
    uint32_t left_last_pulse_snap  = s_enc_left_last_pulse_ms;
    uint32_t right_last_pulse_snap = s_enc_right_last_pulse_ms;
    interrupts();

    int32_t delta_left  = left_now  - s_enc_last_left;
    int32_t delta_right = right_now - s_enc_last_right;

    // FIX [BUG-05]: Only recompute RPM when dt >= ENCODER_RPM_WINDOW_MS.
    //   Calling Update() faster than the window (e.g. during burst polling)
    //   causes inflated RPM because delta ticks accumulate over a short dt.
    //   RPM is only valid over the nominal window; skip update otherwise.
    float dt_f = (float)dt;
    if (dt >= ENCODER_RPM_WINDOW_MS) {
        s_enc_data.left_rpm  = ((float)delta_left  / (float)ENCODER_PPR_WHEEL) * (60000.0f / dt_f);
        s_enc_data.right_rpm = ((float)delta_right / (float)ENCODER_PPR_WHEEL) * (60000.0f / dt_f);
    }

    // Zero RPM if no pulse within stale threshold
    if ((now - left_last_pulse_snap)  > ENCODER_STALE_THRESHOLD_MS) s_enc_data.left_rpm  = 0.0f;
    if ((now - right_last_pulse_snap) > ENCODER_STALE_THRESHOLD_MS) s_enc_data.right_rpm = 0.0f;

    // Cumulative distance
    s_enc_data.left_mm  = (float)left_now  * MM_PER_TICK;
    s_enc_data.right_mm = (float)right_now * MM_PER_TICK;

    // FIX [BUG-04]: Use left_now/right_now (already snapshotted above) instead
    //   of re-reading volatile s_enc_left_ticks in a second atomic block.
    s_enc_data.left_ticks  = left_now;
    s_enc_data.right_ticks = right_now;

    s_enc_last_left  = left_now;
    s_enc_last_right = right_now;
    s_enc_last_time  = now;
}

/** @return Full encoder snapshot */
EncoderData DRV_ENCODER_GetData(void) {
    return s_enc_data;
}

/**
 * @brief  Reset tick counters and distance accumulators to zero.
 *         FIX [W7]: also resets s_enc_last_time to prevent spurious
 *         RPM spike on the first Update() after reset.
 *         Use at path start to measure segment distance.
 */
void DRV_ENCODER_Reset(void) {
    noInterrupts();
    s_enc_left_ticks  = 0;
    s_enc_right_ticks = 0;
    interrupts();
    s_enc_last_left   = 0;
    s_enc_last_right  = 0;
    s_enc_data.left_mm  = 0.0f;
    s_enc_data.right_mm = 0.0f;
    // FIX [W7]: reset time base to prevent RPM spike on first update after reset
    s_enc_last_time = HAL_SYSTEM_GetTick();
}

/**
 * @brief  Return average of left and right odometer distance.
 * @return Distance in mm since last Reset()
 */
float DRV_ENCODER_GetDistanceMM(void) {
    return (s_enc_data.left_mm + s_enc_data.right_mm) / 2.0f;
}

