Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 7 — L298N MOTOR DRIVER
// ════════════════════════════════════════════════════════════
// ============================================================

/**
 * @brief  Configure direction GPIO pins as outputs, init LEDC PWM.
 *         Both motors stopped at init.
 * @return void
 */
void DRV_L298N_Init(void) {
    pinMode(MOTOR_A_DIR_PIN, OUTPUT);
    pinMode(MOTOR_B_DIR_PIN, OUTPUT);
    digitalWrite(MOTOR_A_DIR_PIN, LOW);
    digitalWrite(MOTOR_B_DIR_PIN, LOW);
    HAL_LEDC_Init();
}

/**
 * @brief  Set both motor speeds simultaneously.
 *         Positive = forward, negative = backward, 0 = stop.
 *         Applies deadband and clamps to ±MOTOR_MAX_SPEED.
 * @param  left   Speed for left motor  (-255 to +255)
 * @param  right  Speed for right motor (-255 to +255)
 */
void DRV_L298N_SetMotors(int16_t left, int16_t right) {
    // Clamp to valid range
    if (left  >  MOTOR_MAX_SPEED) left  =  MOTOR_MAX_SPEED;
    if (left  < -MOTOR_MAX_SPEED) left  = -MOTOR_MAX_SPEED;
    if (right >  MOTOR_MAX_SPEED) right =  MOTOR_MAX_SPEED;
    if (right < -MOTOR_MAX_SPEED) right = -MOTOR_MAX_SPEED;

    // Motor A (left)
    if (left > 0) {
        uint8_t duty = (left < MOTOR_DEADBAND) ? (uint8_t)MOTOR_DEADBAND : (uint8_t)left;
        HAL_LEDC_SetDirection(LEDC_MOTOR_A, MOTOR_DIR_FORWARD);
        HAL_LEDC_SetDuty(LEDC_MOTOR_A, duty);
    } else if (left < 0) {
        int16_t mag  = -left;
        uint8_t duty = (mag < MOTOR_DEADBAND) ? (uint8_t)MOTOR_DEADBAND : (uint8_t)mag;
        HAL_LEDC_SetDirection(LEDC_MOTOR_A, MOTOR_DIR_BACKWARD);
        HAL_LEDC_SetDuty(LEDC_MOTOR_A, duty);
    } else {
        HAL_LEDC_Stop(LEDC_MOTOR_A);
    }

    // Motor B (right)
    if (right > 0) {
        uint8_t duty = (right < MOTOR_DEADBAND) ? (uint8_t)MOTOR_DEADBAND : (uint8_t)right;
        HAL_LEDC_SetDirection(LEDC_MOTOR_B, MOTOR_DIR_FORWARD);
        HAL_LEDC_SetDuty(LEDC_MOTOR_B, duty);
    } else if (right < 0) {
        int16_t mag  = -right;
        uint8_t duty = (mag < MOTOR_DEADBAND) ? (uint8_t)MOTOR_DEADBAND : (uint8_t)mag;
        HAL_LEDC_SetDirection(LEDC_MOTOR_B, MOTOR_DIR_BACKWARD);
        HAL_LEDC_SetDuty(LEDC_MOTOR_B, duty);
    } else {
        HAL_LEDC_Stop(LEDC_MOTOR_B);
    }
}

/**
 * @brief  Controlled stop — zero duty, apply brake on both motors.
 * @return void
 */
void DRV_L298N_Stop(void) {
    HAL_LEDC_StopAll();
    digitalWrite(MOTOR_A_DIR_PIN, LOW);
    digitalWrite(MOTOR_B_DIR_PIN, LOW);
}

/**
 * @brief  Emergency brake — highest priority motor command.
 *         Bypasses all logic; zeroes PWM and direction immediately.
 * @return void
 */
void DRV_L298N_EmergencyBrake(void) {
    // HAL_LEDC_StopAll is atomic — stops both channels in one call
    HAL_LEDC_StopAll();
    digitalWrite(MOTOR_A_DIR_PIN, LOW);
    digitalWrite(MOTOR_B_DIR_PIN, LOW);
}

/**
 * @brief  Rotate robot by `degrees` using AK8963 compass heading.
 *         Spins left motor forward, right motor backward (positive = CW).
 *         Blocks until target heading reached within MOTOR_TURN_HEADING_TOL_DEG.
 *         FIX [W4]: Returns true if turn completed, false if 5s timeout elapsed.
 *         Caller must check return value and handle timeout (e.g., re-localise).
 * @param  degrees  Rotation angle (positive = CW, negative = CCW)
 * @param  speed    Motor duty cycle during turn (0–255)
 * @return true = heading achieved, false = timed out
 */
bool DRV_L298N_TurnDegrees(float degrees, uint8_t speed) {
    // FIX [BUG-03]: Refresh magnetometer before sampling start heading.
    //   Previous code read DRV_AK8963_GetHeading() without first calling
    //   DRV_AK8963_Update(), so the start reference could be >10ms stale,
    //   causing the target heading to be computed from an old bearing.
    DRV_AK8963_Update();
    float start_heading  = DRV_AK8963_GetHeading();
    float target_heading = start_heading + degrees;

    // Normalize target to 0–360
    target_heading = fmodf(target_heading, 360.0f);
    if (target_heading < 0.0f) target_heading += 360.0f;

    // Determine spin direction
    int16_t left_spd  =  (int16_t)speed;
    int16_t right_spd = -(int16_t)speed;
    if (degrees < 0.0f) {
        left_spd  = -(int16_t)speed;
        right_spd =  (int16_t)speed;
    }

    DRV_L298N_SetMotors(left_spd, right_spd);

    bool    success  = false;
    uint32_t deadline = HAL_SYSTEM_GetTick() + 5000;

    while (HAL_SYSTEM_GetTick() < deadline) {
        HAL_SYSTEM_FeedWatchdog();
        DRV_AK8963_Update();

        float current = DRV_AK8963_GetHeading();
        float error   = target_heading - current;

        // Handle wrap-around at 0/360 boundary
        if (error >  180.0f) error -= 360.0f;
        if (error < -180.0f) error += 360.0f;

        if (fabsf(error) <= MOTOR_TURN_HEADING_TOL_DEG) {
            success = true;
            break;
        }
        HAL_SYSTEM_DelayMs(10);
    }

    DRV_L298N_Stop();

    // FIX [W4]: warn on timeout so caller can handle navigation failure
    if (!success) {
        Serial.println(F("[WARN] DRV_L298N_TurnDegrees: timeout — heading not reached"));
    }

    return success;
}

// ============================================================
// ════════════════════════════════════════════════════════════
//  DRIVER 8 — BATTERY MONITOR
// ════════════════════════════════════════════════════════════
// ============================================================

static BatteryData s_battery        = {0.0f, false, false, 0};
static uint32_t    s_battery_last_ms = 0;

/**
 * @brief  Initialise battery monitor (calls HAL_ADC_Init internally).
 * @return void
 */
void DRV_BATTERY_Init(void) {
    HAL_ADC_Init();
    // Take initial reading to populate struct
    float v = HAL_ADC_ReadBatteryVoltage();
    s_battery.voltage     = v;
    s_battery.is_low      = (v < BATTERY_LOW_THRESHOLD_V);
    s_battery.is_very_low = (v < BATTERY_VERYLOW_THRESHOLD_V);

    float range   = BATTERY_FULL_V - BATTERY_VERYLOW_THRESHOLD_V;
    float percent = ((v - BATTERY_VERYLOW_THRESHOLD_V) / range) * 100.0f;
    if (percent > 100.0f) percent = 100.0f;
    if (percent <   0.0f) percent =   0.0f;
    s_battery.percent = (uint8_t)percent;

    s_battery_last_ms = HAL_SYSTEM_GetTick();
}

/**
 * @brief  Low-pass filter new ADC reading, update thresholds.
 *         FIX [W6]: Removed direct call to DRV_L298N_EmergencyBrake().
 *         Calling a motor driver from the battery driver is a layering
 *         violation and is unsafe if motors are not yet initialized.
 *         The application layer MUST poll DRV_BATTERY_IsVeryLow() and
 *         call DRV_L298N_EmergencyBrake() itself.
 *         Call every BATTERY_CHECK_INTERVAL_MS (1s) from main loop.
 * @return void
 */
void DRV_BATTERY_Update(void) {
    uint32_t now = HAL_SYSTEM_GetTick();
    if ((now - s_battery_last_ms) < BATTERY_CHECK_INTERVAL_MS) return;
    s_battery_last_ms = now;

