Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
    float new_v = HAL_ADC_ReadBatteryVoltage();

    // First-order IIR low-pass filter
    s_battery.voltage = BATTERY_FILTER_ALPHA * new_v
                      + (1.0f - BATTERY_FILTER_ALPHA) * s_battery.voltage;

    s_battery.is_low      = (s_battery.voltage < BATTERY_LOW_THRESHOLD_V);
    s_battery.is_very_low = (s_battery.voltage < BATTERY_VERYLOW_THRESHOLD_V);

    // Compute percent — clamp 0–100
    float range   = BATTERY_FULL_V - BATTERY_VERYLOW_THRESHOLD_V;
    float percent = ((s_battery.voltage - BATTERY_VERYLOW_THRESHOLD_V) / range) * 100.0f;
    if (percent > 100.0f) percent = 100.0f;
    if (percent <   0.0f) percent =   0.0f;
    s_battery.percent = (uint8_t)percent;

    // FIX [W6]: Emergency brake removed from here.
    // Application layer in loop() already checks DRV_BATTERY_IsVeryLow()
    // and must call DRV_L298N_EmergencyBrake() there.
}

/** @return Full battery snapshot */
BatteryData DRV_BATTERY_GetData(void) {
    return s_battery;
}

/** @return true if battery below LOW threshold */
bool DRV_BATTERY_IsLow(void) {
    return s_battery.is_low;
}

/** @return true if battery below VERY LOW threshold (emergency) */
bool DRV_BATTERY_IsVeryLow(void) {
    return s_battery.is_very_low;
}
// APP_MT3 content included via ESP32_INTEGRATED.h
#include <string.h>
#include <stdint.h>

// ============================================================
// MODULE: SENSOR FUSION
// ============================================================

static SensorFrame _fusion_frame;

void MOD_SENSORFUSION_Init(void) {
    memset(&_fusion_frame, 0, sizeof(SensorFrame));
}

void MOD_SENSORFUSION_Update(void) {
    // --- IMU ---
    DRV_MPU9250_Update();
    DRV_AK8963_Update();

    IMUData imu = DRV_MPU9250_GetData();
    // AK8963 heading accessed via imu.mag_heading_deg (already populated by DRV_MPU9250_GetData)

    // FIX [CRITICAL-1]: heading_deg was being set to gyro_z_dps (angular rate),
    // not integrated heading. Now using imu.heading_deg (integrated by driver).
    _fusion_frame.heading_deg     = imu.heading_deg;
    _fusion_frame.mag_heading_deg = imu.mag_heading_deg;
    _fusion_frame.pitch_deg       = imu.pitch_deg;
    _fusion_frame.roll_deg        = imu.roll_deg;

    // --- Color sensor ---
    DRV_TCS3200_Update();
    _fusion_frame.color = DRV_TCS3200_GetColor();

    // --- Line sensor ---
    DRV_LINE_Update();
    LineData line = DRV_LINE_GetData();
    _fusion_frame.line_error   = line.error;
    _fusion_frame.line_lost    = line.line_lost;
    _fusion_frame.line_bitmask = line.bitmask;

    // --- Ultrasonic (non-blocking) ---
    _fusion_frame.distance_cm = DRV_HCSR04_GetDistance();
    _fusion_frame.obstacle    = (_fusion_frame.distance_cm < HCSR04_OBSTACLE_THRESHOLD_CM);

    // --- Encoders ---
    DRV_ENCODER_Update();
    EncoderData enc = DRV_ENCODER_GetData();
    _fusion_frame.enc_left_ticks  = enc.left_ticks;
    _fusion_frame.enc_right_ticks = enc.right_ticks;
    _fusion_frame.left_rpm        = enc.left_rpm;
    _fusion_frame.right_rpm       = enc.right_rpm;

    // --- Battery ---
    DRV_BATTERY_Update();
    BatteryData bat = DRV_BATTERY_GetData();
    _fusion_frame.battery_v        = bat.voltage;
    _fusion_frame.battery_low      = bat.is_low;
    _fusion_frame.battery_very_low = bat.is_very_low;
    _fusion_frame.battery_percent  = bat.percent;

    // --- Timestamp ---
    _fusion_frame.timestamp_ms = HAL_SYSTEM_GetTick();
}

SensorFrame MOD_SENSORFUSION_GetFrame(void) {
    return _fusion_frame;
}

// ============================================================
// MODULE: PID CONTROLLER
// ============================================================

static float   _pid_kp              = PID_KP;
static float   _pid_ki              = PID_KI;
static float   _pid_kd              = PID_KD;
static int16_t _pid_base_speed      = PID_BASE_SPEED;
static float   _pid_integral        = 0.0f;
static float   _pid_prev_error      = 0.0f;
static float   _pid_prev_derivative = 0.0f;
static int16_t _pid_left_speed      = 0;
static int16_t _pid_right_speed     = 0;

void MOD_PID_Init(void) {
    _pid_kp         = PID_KP;
    _pid_ki         = PID_KI;
    _pid_kd         = PID_KD;
    _pid_base_speed = PID_BASE_SPEED;
    MOD_PID_Reset();
}

void MOD_PID_Reset(void) {
    _pid_integral        = 0.0f;
    _pid_prev_error      = 0.0f;
    _pid_prev_derivative = 0.0f;
    _pid_left_speed      = 0;
    _pid_right_speed     = 0;
}

void MOD_PID_Update(int8_t error) {
    const float dt = PID_SAMPLE_TIME_MS / 1000.0f;

    // Proportional
    float P = _pid_kp * (float)error;

    // Integral with anti-windup
    _pid_integral += (float)error * dt;
    if (_pid_integral >  PID_ANTI_WINDUP_LIMIT) _pid_integral =  PID_ANTI_WINDUP_LIMIT;
    if (_pid_integral < -PID_ANTI_WINDUP_LIMIT) _pid_integral = -PID_ANTI_WINDUP_LIMIT;
    float I = _pid_ki * _pid_integral;

    // Derivative with low-pass filter (prevents derivative kick on setpoint change)
    float raw_derivative      = ((float)error - _pid_prev_error) / dt;
    float filtered_derivative = PID_DERIVATIVE_FILTER * _pid_prev_derivative
                              + (1.0f - PID_DERIVATIVE_FILTER) * raw_derivative;
    float D = _pid_kd * filtered_derivative;
    _pid_prev_derivative = filtered_derivative;

    // Output
    float output = P + I + D;
    if (output >  (float)PID_MAX_OUTPUT) output =  (float)PID_MAX_OUTPUT;
    // FIX [BUG-05]: Apply PID_MIN_OUTPUT for the lower clamp instead of
    // negating PID_MAX_OUTPUT.  Both resolve to -255 with default config,
    // but using the named constant makes asymmetric tuning possible and
    // matches the documented intent.
    if (output < (float)PID_MIN_OUTPUT) output = (float)PID_MIN_OUTPUT;

    // Differential drive commands
    int16_t ls = (int16_t)((float)_pid_base_speed - output);
    int16_t rs = (int16_t)((float)_pid_base_speed + output);

    // Clamp both to valid PWM range
    if (ls >  PID_MAX_OUTPUT) ls =  PID_MAX_OUTPUT;
    if (ls <  PID_MIN_OUTPUT) ls =  PID_MIN_OUTPUT;
    if (rs >  PID_MAX_OUTPUT) rs =  PID_MAX_OUTPUT;
    if (rs <  PID_MIN_OUTPUT) rs =  PID_MIN_OUTPUT;

    _pid_left_speed  = ls;
    _pid_right_speed = rs;
    _pid_prev_error  = (float)error;
}

int16_t MOD_PID_GetLeftSpeed(void)  { return _pid_left_speed;  }
int16_t MOD_PID_GetRightSpeed(void) { return _pid_right_speed; }

