Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
void MOD_PID_SetGains(float kp, float ki, float kd) {
    // FIX [CRITICAL-2]: Validate gains before accepting — a corrupted or
    // malicious CAM config packet must not cause runaway motor behavior.
    if (kp < 0.0f || kp > PID_KP_MAX) return;
    if (ki < 0.0f || ki > PID_KI_MAX) return;
    if (kd < 0.0f || kd > PID_KD_MAX) return;
    _pid_kp = kp;
    _pid_ki = ki;
    _pid_kd = kd;
}

void MOD_PID_SetBaseSpeed(int16_t speed) {
    _pid_base_speed = speed;
}

// ============================================================
// MODULE: PACKET BUILDER
// ============================================================

// CRC-8 with polynomial 0x07 (standard CRC-8, no initial value, no final XOR)
// FIX [WARNING-1]: const-correct pointer — callers must not mutate data through this.
uint8_t MOD_PACKET_CRC8(const uint8_t* data, uint8_t len) {
    uint8_t crc = 0x00U;
    for (uint8_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (uint8_t b = 0; b < 8U; b++) {
            if (crc & 0x80U) {
                crc = (uint8_t)((crc << 1) ^ 0x07U);
            } else {
                crc <<= 1U;
            }
        }
    }
    return crc;
}

// Frame: [0xAA | type | len | payload[0..len-1] | CRC8 | 0x55]
// Returns total frame length.
// FIX [WARNING-1]: const-correct payload pointer.
uint8_t MOD_PACKET_Build(uint8_t type, const uint8_t* payload, uint8_t len, uint8_t* out) {
    // FIX [CRITICAL-3]: Guard against len > PACKET_MAX_PAYLOAD to prevent
    // crc_buf overrun (was silent UB in original).
    if (len > PACKET_MAX_PAYLOAD) {
        len = PACKET_MAX_PAYLOAD;
    }

    uint8_t crc_buf[2U + PACKET_MAX_PAYLOAD];
    crc_buf[0] = type;
    crc_buf[1] = len;
    for (uint8_t i = 0; i < len; i++) {
        crc_buf[2U + i] = payload[i];
    }
    uint8_t crc = MOD_PACKET_CRC8(crc_buf, (uint8_t)(2U + len));

    out[0] = PACKET_START_BYTE;
    out[1] = type;
    out[2] = len;
    for (uint8_t i = 0; i < len; i++) {
        out[3U + i] = payload[i];
    }
    out[3U + len] = crc;
    out[4U + len] = PACKET_END_BYTE;

    return (uint8_t)(5U + len);
}

// FIX [WARNING-1]: const-correct frame pointer.
bool MOD_PACKET_Validate(const uint8_t* frame, uint8_t len) {
    // Minimum frame: [start, type, paylen, crc, end] = 5 bytes
    if (len < 5U) return false;
    if (frame[0] != PACKET_START_BYTE)   return false;
    if (frame[len - 1U] != PACKET_END_BYTE) return false;

    uint8_t pay_len = frame[2];

    // FIX [CRITICAL-3]: Guard pay_len before computing expected length —
    // a malformed packet with pay_len=250 would overflow the uint8_t addition.
    if (pay_len > PACKET_MAX_PAYLOAD) return false;

    // Total expected: 5 + pay_len
    if (len != (uint8_t)(5U + pay_len)) return false;

    // Recompute CRC over [type, len, payload]
    uint8_t crc_buf[2U + PACKET_MAX_PAYLOAD];
    crc_buf[0] = frame[1];   // type
    crc_buf[1] = pay_len;
    for (uint8_t i = 0; i < pay_len; i++) {
        crc_buf[2U + i] = frame[3U + i];
    }
    uint8_t computed = MOD_PACKET_CRC8(crc_buf, (uint8_t)(2U + pay_len));
    uint8_t received = frame[3U + pay_len];

    return (computed == received);
}

// ============================================================
// MODULE: PATH RECORDING
// ============================================================

static PathNode  _path_nodes[PATH_MAX_NODES];
static uint16_t  _path_head       = 0;   // next write index (circular)
static uint16_t  _path_count      = 0;   // total valid nodes (max PATH_MAX_NODES)
static bool      _path_recording  = false;
static uint32_t  _path_last_ms    = 0;

void PATH_Init(void) {
    memset(_path_nodes, 0, sizeof(_path_nodes));
    _path_head      = 0;
    _path_count     = 0;
    _path_recording = false;
    _path_last_ms   = 0;
}

void PATH_StartRecording(void) {
    PATH_Clear();
    _path_recording = true;
    _path_last_ms   = 0;
}

void PATH_StopRecording(void) {
    _path_recording = false;
}

bool PATH_IsRecording(void) {
    return _path_recording;
}

void PATH_RecordNode(SensorFrame frame) {
    if (!_path_recording) return;
    if ((frame.timestamp_ms - _path_last_ms) < PATH_RECORD_INTERVAL_MS) return;
    _path_last_ms = frame.timestamp_ms;

    _path_nodes[_path_head].enc_left     = frame.enc_left_ticks;
    _path_nodes[_path_head].enc_right    = frame.enc_right_ticks;
    _path_nodes[_path_head].heading      = frame.heading_deg;
    _path_nodes[_path_head].timestamp_ms = frame.timestamp_ms;

    _path_head = (uint16_t)((_path_head + 1U) % PATH_MAX_NODES);

    if (_path_count < PATH_MAX_NODES) {
        _path_count++;
    }
    // If full, circular overwrite — _path_count stays at PATH_MAX_NODES
}

// Returns node at logical index (0 = oldest, count-1 = newest).
// FIX [BUG-08]: Clamp index to valid range before resolving physical address.
// The original code silently wrapped an out-of-bounds index via modulo, which
// returned stale data with no indication of the error.
PathNode PATH_GetNode(uint16_t index) {
    // Clamp to the number of valid entries
    if (_path_count == 0U) {
        PathNode empty;
        memset(&empty, 0, sizeof(PathNode));
        return empty;
    }
    if (index >= _path_count) {
        index = (uint16_t)(_path_count - 1U);
    }

    uint16_t actual;
    if (_path_count < PATH_MAX_NODES) {
        // Buffer not yet full — entries start at physical index 0
        actual = index;
    } else {
        // Buffer is full — oldest is at _path_head
        actual = (uint16_t)((_path_head + index) % PATH_MAX_NODES);
    }
    return _path_nodes[actual];
}

uint16_t PATH_GetNodeCount(void) {
    return _path_count;
}

void PATH_Clear(void) {
    _path_head  = 0;
    _path_count = 0;
    memset(_path_nodes, 0, sizeof(_path_nodes));
}

// ============================================================
// MODULE: STATE MACHINE
// ============================================================

static SystemState _sm_state           = STATE_INIT;
static SystemState _sm_prev_state      = STATE_INIT;
static SystemEvent _sm_pending_event   = EVENT_NONE;
static bool        _sm_order_confirmed = false;

// Obstacle tracking
static uint32_t    _sm_obstacle_enter_ms      = 0;
static uint32_t    _sm_obstacle_recheck_ms    = 0;
static uint8_t     _sm_obstacle_clear_count   = 0;

// Delivery tracking
static uint32_t    _sm_deliver_enter_ms = 0;
static bool        _sm_deliver_waited   = false;

