Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
// Recovery tracking
static uint32_t    _sm_recovery_enter_ms  = 0;
static float       _sm_recovery_spin_deg  = 0.0f;
static bool        _sm_recovery_spin_dir  = true;   // true = CW, false = CCW
static bool        _sm_recovery_reversed  = false;

// FIX [BUG-01]: _sm_return_node_index was set on delivery/recovery but never
// read or decremented during STATE_RETURN.  The variable has been removed.
// STATE_RETURN relies on PID line following until the home color marker is
// detected.  This is the actual runtime behavior in all prior versions;
// the index variable was dead code that implied non-existent path-replay logic.
// If encoder-based path replay is added in a future revision, re-introduce
// the index with a matching replay loop in STATE_RETURN.

static const char* _sm_state_strings[] = {
    "INIT    ",   // 8 chars (STATE_INIT)
    "IDLE    ",   // 8 chars (STATE_IDLE)
    "NAVIGATE",   // 8 chars (STATE_NAVIGATE)
    "OBSTACLE",   // 8 chars (STATE_OBSTACLE)
    "DELIVER ",   // 8 chars (STATE_DELIVER)
    "RETURN  ",   // 8 chars (STATE_RETURN)
    "RECOVERY",   // 8 chars (STATE_RECOVERY)
    "LOW BAT ",   // 8 chars (STATE_LOW_BATTERY)
    // FIX [BUG-04]: "EMERGENCY" is 9 chars.  MOD_UART_CAM_SendTelemetry()
    // copies exactly 8 chars with a null-guard, so the 9th char ('Y') was
    // silently dropped and sent as a space — wrong telemetry display on the
    // dashboard.  Truncated to 8 printable chars to match all other entries.
    "EMERGENC"    // 8 chars (STATE_EMERGENCY) — intentional truncation
};

void MOD_SM_Init(void) {
    _sm_state           = STATE_INIT;
    _sm_prev_state      = STATE_INIT;
    _sm_pending_event   = EVENT_NONE;
    _sm_order_confirmed = false;
}

void MOD_SM_InjectEvent(SystemEvent event) {
    // Emergency always wins immediately — but respect an active RETURN
    if (event == EVENT_VERY_LOW_BATTERY) {
        if (_sm_state != STATE_RETURN) {
            _sm_state = STATE_EMERGENCY;
            DRV_L298N_EmergencyBrake();
        }
        return;
    }
    // FIX [WARNING-2]: Only overwrite pending event if it is more urgent, or slot
    // is empty. This prevents a low-priority event from wiping a critical one that
    // arrived in the same loop tick.  Simplified rule: keep the lowest enum value
    // (smaller value = higher priority by definition above), but never overwrite
    // a real event with EVENT_NONE.
    if (_sm_pending_event == EVENT_NONE) {
        _sm_pending_event = event;
    } else if ((uint8_t)event < (uint8_t)_sm_pending_event) {
        _sm_pending_event = event;
    }
}

SystemState MOD_SM_GetState(void) {
    return _sm_state;
}

const char* MOD_SM_GetStateString(void) {
    if (_sm_state <= STATE_EMERGENCY) {
        return _sm_state_strings[(int)_sm_state];
    }
    return "UNKNOWN ";
}

bool MOD_SM_IsOrderConfirmed(void) {
    return _sm_order_confirmed;
}

void MOD_SM_ConfirmOrder(void) {
    _sm_order_confirmed = true;
}

// Internal helper: apply low battery speed scaling
static void _sm_apply_speed(int16_t left, int16_t right, bool low_bat) {
    if (low_bat) {
        left  = (int16_t)((float)left  * LOW_BATTERY_SPEED_FACTOR);
        right = (int16_t)((float)right * LOW_BATTERY_SPEED_FACTOR);
    }
    DRV_L298N_SetMotors(left, right);
}

void MOD_SM_Update(SensorFrame frame) {
    uint32_t now = frame.timestamp_ms;

    // ---- Global battery emergency check (every state except EMERGENCY) ----
    if (_sm_state != STATE_EMERGENCY) {
        if (frame.battery_very_low) {
            // Allow STATE_RETURN to finish
            if (_sm_state != STATE_RETURN) {
                _sm_state = STATE_EMERGENCY;
                DRV_L298N_EmergencyBrake();
                return;
            }
        }
    }

    // Consume pending event
    SystemEvent ev = _sm_pending_event;
    _sm_pending_event = EVENT_NONE;

    switch (_sm_state) {

        // --------------------------------------------------------
        case STATE_INIT:
            // FIX [WARNING-3]: Re-initialising sensor fusion and PID inside the
            // state machine update is unexpected — these were already called in
            // APP_MAIN_Init.  In a multi-call scenario this wipes any calibration.
            // Removed the duplicate calls; only reset path and order flag here.
            PATH_Init();
            _sm_order_confirmed = false;
            _sm_state = STATE_IDLE;
            break;

        // --------------------------------------------------------
        case STATE_IDLE:
            DRV_L298N_Stop();
            if (_sm_order_confirmed) {
                PATH_StartRecording();
                MOD_PID_Reset();
                _sm_state = STATE_NAVIGATE;
            }
            break;

        // --------------------------------------------------------
        case STATE_NAVIGATE:
            // Record path
            PATH_RecordNode(frame);

            // Battery degraded — downshift to LOW_BATTERY
            if ((ev == EVENT_LOW_BATTERY) || frame.battery_low) {
                _sm_state = STATE_LOW_BATTERY;
                break;
            }

            // Check arrival at delivery
            if ((ev == EVENT_DELIVERY_REACHED) || (frame.color == DELIVERY_DETECTION_COLOR)) {
                PATH_StopRecording();
                DRV_L298N_Stop();
                _sm_deliver_enter_ms = now;
                _sm_deliver_waited   = false;
                _sm_state = STATE_DELIVER;
                break;
            }

            // Obstacle check
            if ((ev == EVENT_OBSTACLE_DETECTED) || frame.obstacle) {
                DRV_L298N_Stop();
                _sm_obstacle_enter_ms    = now;
                _sm_obstacle_recheck_ms  = now;
                _sm_obstacle_clear_count = 0;
                _sm_state = STATE_OBSTACLE;
                break;
            }

            // Line lost
            if ((ev == EVENT_LINE_LOST) || frame.line_lost) {
                DRV_L298N_Stop();
                _sm_recovery_enter_ms = now;
                _sm_recovery_spin_deg = 0.0f;
                _sm_recovery_spin_dir = true;
                _sm_recovery_reversed = false;
                _sm_state = STATE_RECOVERY;
                break;
            }

            // PID line following
#ifdef NAV_MODE_SIMPLE_PID
            MOD_PID_Update(frame.line_error);
            _sm_apply_speed(MOD_PID_GetLeftSpeed(), MOD_PID_GetRightSpeed(), frame.battery_low);
#endif
#ifdef NAV_MODE_GRID_FLOODFILL
            FF_Update(frame);
#endif
            break;

