Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
        // --------------------------------------------------------
        case STATE_OBSTACLE:
            DRV_L298N_Stop();

            // FIX [BUG-03]: OBSTACLE_WAIT_MS was defined but never used.
            // _sm_obstacle_enter_ms was recorded but the state machine had no
            // hard timeout — a stuck obstacle sensor would park the robot forever.
            // Added a hard timeout: after OBSTACLE_WAIT_MS milliseconds the robot
            // declares the path clear and resumes.  This matches the documented
            // behavior in the header comment ("wait before retrying").
            if ((now - _sm_obstacle_enter_ms) >= OBSTACLE_WAIT_MS) {
                // Hard timeout — force resume regardless of sensor reading.
                // This handles a failed/stuck ultrasonic sensor gracefully.
                MOD_PID_Reset();
                _sm_state = STATE_NAVIGATE;
                break;
            }

            // Periodic recheck (runs only within the OBSTACLE_WAIT_MS window)
            if ((now - _sm_obstacle_recheck_ms) >= OBSTACLE_RECHECK_INTERVAL_MS) {
                _sm_obstacle_recheck_ms = now;

                if (!frame.obstacle) {
                    _sm_obstacle_clear_count++;
                } else {
                    _sm_obstacle_clear_count = 0;  // reset on flap
                }

                if (_sm_obstacle_clear_count >= OBSTACLE_CLEAR_COUNT_REQUIRED) {
                    MOD_PID_Reset();
                    _sm_state = STATE_NAVIGATE;
                }
            }
            break;

        // --------------------------------------------------------
        case STATE_DELIVER:
            DRV_L298N_Stop();

            if (!_sm_deliver_waited) {
                if ((now - _sm_deliver_enter_ms) >= DELIVERY_WAIT_MS) {
                    _sm_deliver_waited = true;
                    // Perform 180° U-turn — blocking call; acceptable here as it is
                    // a deliberate, one-shot manoeuvre at a known static location.
                    DRV_L298N_TurnDegrees(RETURN_TURN_DEGREES, RETURN_TURN_SPEED);
                    // FIX [BUG-01]: Removed dead _sm_return_node_index assignment.
                    MOD_PID_Reset();
                    _sm_state = STATE_RETURN;
                }
            }
            break;

        // --------------------------------------------------------
        case STATE_RETURN: {
            // Check home color
            if ((ev == EVENT_HOME_REACHED) || (frame.color == HOME_DETECTION_COLOR)) {
                DRV_L298N_Stop();
                PATH_Clear();
                _sm_order_confirmed = false;
                _sm_state = STATE_IDLE;
                break;
            }

            // PID still active on the line during return
            if (!frame.line_lost) {
                MOD_PID_Update(frame.line_error);
                // battery_very_low: robot is running return path so we permit it
                // but apply speed reduction regardless
                _sm_apply_speed(MOD_PID_GetLeftSpeed(), MOD_PID_GetRightSpeed(),
                                frame.battery_low || frame.battery_very_low);
            } else {
                DRV_L298N_Stop();
            }
            break;
        }

        // --------------------------------------------------------
        case STATE_RECOVERY: {
            bool timed_out = ((now - _sm_recovery_enter_ms) >= LINE_LOST_RECOVERY_TIMEOUT_MS);

            // Line found → resume navigate
            if ((ev == EVENT_LINE_FOUND) || !frame.line_lost) {
                MOD_PID_Reset();
                _sm_state = STATE_NAVIGATE;
                break;
            }

            if (!timed_out) {
                // Slow ±30° spin search
                if (!_sm_recovery_reversed) {
                    if (_sm_recovery_spin_dir) {
                        DRV_L298N_SetMotors(50, -50);   // CW
                        _sm_recovery_spin_deg += 1.0f;
                        if (_sm_recovery_spin_deg >= 30.0f) {
                            _sm_recovery_spin_dir = false;
                            _sm_recovery_spin_deg = 0.0f;
                        }
                    } else {
                        DRV_L298N_SetMotors(-50, 50);   // CCW
                        _sm_recovery_spin_deg += 1.0f;
                        if (_sm_recovery_spin_deg >= 60.0f) {
                            _sm_recovery_spin_dir = true;
                            _sm_recovery_spin_deg = 0.0f;
                        }
                    }
                }
            } else if (!_sm_recovery_reversed) {
                // FIX [CRITICAL-4]: Removed HAL_SYSTEM_DelayMs(300) blocking call.
                // Replaced with non-blocking reverse managed across loop ticks.
                _sm_recovery_reversed = true;
                _sm_recovery_enter_ms = now;  // reuse enter_ms as reverse timer

                if (PATH_GetNodeCount() > 0) {
                    DRV_L298N_SetMotors(-60, -60);  // begin reverse
                }
            } else {
                // FIX [CRITICAL-4] continued: hold reverse for 300 ms then stop/decide
                if ((now - _sm_recovery_enter_ms) < 300U) {
                    if (PATH_GetNodeCount() > 0) {
                        DRV_L298N_SetMotors(-60, -60);
                    }
                } else {
                    // Reverse done — still lost → return home via line following
                    DRV_L298N_Stop();
                    PATH_StopRecording();
                    MOD_PID_Reset();
                    _sm_state = STATE_RETURN;
                }
            }
            break;
        }

        // --------------------------------------------------------
        case STATE_LOW_BATTERY:
            // Continue task at 70% speed
            PATH_RecordNode(frame);

            if ((ev == EVENT_DELIVERY_REACHED) || (frame.color == DELIVERY_DETECTION_COLOR)) {
                PATH_StopRecording();
                DRV_L298N_Stop();
                _sm_deliver_enter_ms = now;
                _sm_deliver_waited   = false;
                _sm_state = STATE_DELIVER;
                break;
            }

            if ((ev == EVENT_OBSTACLE_DETECTED) || frame.obstacle) {
                DRV_L298N_Stop();
                _sm_obstacle_enter_ms    = now;
                _sm_obstacle_recheck_ms  = now;
                _sm_obstacle_clear_count = 0;
                _sm_state = STATE_OBSTACLE;
                break;
            }

