Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
            if ((ev == EVENT_LINE_LOST) || frame.line_lost) {
                DRV_L298N_Stop();
                _sm_recovery_enter_ms = now;
                _sm_recovery_spin_deg = 0.0f;
                _sm_recovery_spin_dir = true;
                _sm_recovery_reversed = false;
                _sm_state = STATE_RECOVERY;
                break;
            }

#ifdef NAV_MODE_SIMPLE_PID
            MOD_PID_Update(frame.line_error);
            _sm_apply_speed(MOD_PID_GetLeftSpeed(), MOD_PID_GetRightSpeed(), true);
#endif
#ifdef NAV_MODE_GRID_FLOODFILL
            FF_Update(frame);
#endif
            break;

        // --------------------------------------------------------
        case STATE_EMERGENCY:
            // Stay here forever — never leave
            DRV_L298N_EmergencyBrake();
            break;

        default:
            break;
    }

    // Detect state transition for UART update
    _sm_prev_state = _sm_state;
}

// ============================================================
// MODULE: UART CAM
// ============================================================

static CAM_Status _cam_status        = CAM_OK;
static uint32_t   _cam_corrupt_count = 0;
static uint32_t   _cam_last_telem_ms = 0;

// Rx parser state machine
typedef enum {
    RX_WAIT_START = 0,
    RX_WAIT_TYPE,
    RX_WAIT_LEN,
    RX_WAIT_PAYLOAD,
    RX_WAIT_CRC,
    RX_WAIT_END
} RxParseState;

static RxParseState _cam_rx_state   = RX_WAIT_START;
static uint8_t      _cam_rx_buf[5U + PACKET_MAX_PAYLOAD];
static uint8_t      _cam_rx_buf_pos = 0;
static uint8_t      _cam_rx_type    = 0;
static uint8_t      _cam_rx_len     = 0;
static uint8_t      _cam_rx_pay_idx = 0;

void MOD_UART_CAM_Init(void) {
    _cam_status        = CAM_OK;
    _cam_corrupt_count = 0;
    _cam_last_telem_ms = 0;
    _cam_rx_state      = RX_WAIT_START;
    _cam_rx_buf_pos    = 0;
}

void MOD_UART_CAM_SendTelemetry(SensorFrame frame, SystemState state) {
    (void)state;   // retained in signature for future use; state is encoded in string below
    uint8_t payload[TELEMETRY_PAYLOAD_SIZE];

    // enc_left / enc_right — truncated to int16, big-endian
    int16_t el  = (int16_t)(frame.enc_left_ticks  & 0xFFFF);
    int16_t er  = (int16_t)(frame.enc_right_ticks & 0xFFFF);
    // heading as degrees*10, int16
    int16_t hdg = (int16_t)(frame.heading_deg * 10.0f);

    payload[0] = (uint8_t)((el  >> 8) & 0xFF);
    payload[1] = (uint8_t)( el        & 0xFF);
    payload[2] = (uint8_t)((er  >> 8) & 0xFF);
    payload[3] = (uint8_t)( er        & 0xFF);
    payload[4] = (uint8_t)((hdg >> 8) & 0xFF);
    payload[5] = (uint8_t)( hdg       & 0xFF);

    // State string — 8 bytes (space-padded, no null terminator in payload)
    // FIX [BUG-04]: _sm_state_strings[] now has exactly 8 printable chars for
    // every entry (including EMERGENCY → "EMERGENC"). The null-guard in the
    // loop below is retained as a safety net but should never trigger.
    const char* ss = MOD_SM_GetStateString();
    for (uint8_t i = 0; i < 8U; i++) {
        payload[6U + i] = (uint8_t)(ss[i] ? ss[i] : ' ');
    }

    uint8_t out[5U + TELEMETRY_PAYLOAD_SIZE];
    uint8_t frame_len = MOD_PACKET_Build(MSG_CAM_TELEMETRY, payload, TELEMETRY_PAYLOAD_SIZE, out);
    HAL_UART_SendBytes(UART_PORT_CAM, out, frame_len);
}

void MOD_UART_CAM_ProcessRx(void) {
    int avail = HAL_UART_BytesAvailable(UART_PORT_CAM);
    while (avail-- > 0) {
        uint8_t b = HAL_UART_ReadByte(UART_PORT_CAM);

        switch (_cam_rx_state) {
            case RX_WAIT_START:
                if (b == PACKET_START_BYTE) {
                    memset(_cam_rx_buf, 0, sizeof(_cam_rx_buf));
                    _cam_rx_buf_pos = 0;
                    _cam_rx_buf[_cam_rx_buf_pos++] = b;
                    _cam_rx_state = RX_WAIT_TYPE;
                }
                break;

            case RX_WAIT_TYPE:
                _cam_rx_type = b;
                _cam_rx_buf[_cam_rx_buf_pos++] = b;
                _cam_rx_state = RX_WAIT_LEN;
                break;

            case RX_WAIT_LEN:
                _cam_rx_len = b;
                _cam_rx_buf[_cam_rx_buf_pos++] = b;
                if (_cam_rx_len == 0U) {
                    _cam_rx_state = RX_WAIT_CRC;
                } else if (_cam_rx_len > PACKET_MAX_PAYLOAD) {
                    // Malformed — reset parser
                    _cam_rx_state = RX_WAIT_START;
                    _cam_corrupt_count++;
                } else {
                    _cam_rx_pay_idx = 0;
                    _cam_rx_state   = RX_WAIT_PAYLOAD;
                }
                break;

            case RX_WAIT_PAYLOAD:
                // FIX [CRITICAL-3]: Guard buf_pos against overrun before writing.
                if (_cam_rx_buf_pos < (uint8_t)sizeof(_cam_rx_buf)) {
                    _cam_rx_buf[_cam_rx_buf_pos++] = b;
                }
                _cam_rx_pay_idx++;
                if (_cam_rx_pay_idx >= _cam_rx_len) {
                    _cam_rx_state = RX_WAIT_CRC;
                }
                break;

            case RX_WAIT_CRC:
                if (_cam_rx_buf_pos < (uint8_t)sizeof(_cam_rx_buf)) {
                    _cam_rx_buf[_cam_rx_buf_pos++] = b;
                }
                _cam_rx_state = RX_WAIT_END;
                break;

            case RX_WAIT_END:
                if (_cam_rx_buf_pos < (uint8_t)sizeof(_cam_rx_buf)) {
                    _cam_rx_buf[_cam_rx_buf_pos++] = b;
                }
                // Validate full frame
                if (MOD_PACKET_Validate(_cam_rx_buf, _cam_rx_buf_pos)) {
                    // Decode message
                    switch (_cam_rx_type) {
                        case MSG_CAM_ERROR: {
                            uint8_t err_code = (_cam_rx_len >= 1U) ? _cam_rx_buf[3] : 0U;
                            switch (err_code) {
                                case 1U: _cam_status = CAM_SD_FAIL;  MOD_SM_InjectEvent(EVENT_CAM_SD_FAIL); break;
                                case 2U: _cam_status = CAM_SD_FULL;  MOD_SM_InjectEvent(EVENT_CAM_SD_FAIL); break;
                                case 3U: _cam_status = CAM_BUF_FULL; break;
                                default: _cam_status = CAM_OK;       break;
                            }
                            break;
                        }
                        case MSG_CAM_CONFIG: {
                            // Config update — PID gains sent from web dashboard via CAM
                            // Payload format: kp(float32 LE) ki(float32 LE) kd(float32 LE) = 12 bytes
                            // FIX [BUG-09]: Comment previously claimed BE byte order.  ESP32 is
                            // little-endian; memcpy into a float is only correct when the sender
                            // also uses little-endian byte order.  CAM firmware must be updated
                            // to send floats in little-endian (native ESP32) format.  If the CAM
                            // sends big-endian, add a 4-byte swap here before the memcpy.
                            // The byte-swap helper is provided for reference:
                            //   uint8_t tmp[4] = {p[3],p[2],p[1],p[0]};
                            //   memcpy(&new_kp, tmp, 4U);
                            if (_cam_rx_len >= 12U) {
                                float new_kp, new_ki, new_kd;
                                const uint8_t* p = &_cam_rx_buf[3];
                                memcpy(&new_kp, p + 0, 4U);
                                memcpy(&new_ki, p + 4, 4U);
                                memcpy(&new_kd, p + 8, 4U);
                                // MOD_PID_SetGains validates ranges internally
                                MOD_PID_SetGains(new_kp, new_ki, new_kd);
                            }
                            break;
                        }
                        default:
                            break;
                    }
                } else {
                    _cam_corrupt_count++;
                }
                _cam_rx_state   = RX_WAIT_START;
                _cam_rx_buf_pos = 0;
                break;
        }
    }
}

CAM_Status MOD_UART_CAM_GetStatus(void) {
    return _cam_status;
}

