Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
// ============================================================
// MODULE: UART NANO
// ============================================================

void MOD_UART_NANO_Init(void) {
    // HAL UART already initialized in APP_MAIN_Init
}

void MOD_UART_NANO_SendInit(void) {
    const uint8_t payload[8] = {'S','Y','S','R','E','A','D','Y'};
    uint8_t out[5U + 8U];
    // FIX [BUG-02]: Use corrected MSG_NANO_INIT (0x10) instead of the original
    // MSG_TYPE_NANO_INIT which collided with MSG_TYPE_TELEMETRY (both 0x01).
    uint8_t len = MOD_PACKET_Build(MSG_NANO_INIT, payload, 8U, out);
    HAL_UART_SendBytes(UART_PORT_NANO, out, len);
}

void MOD_UART_NANO_SendState(SystemState state) {
    // FIX [CRITICAL-5]: "EMERGENCY" is 9 characters — reading ss[i] for i=8
    // on a string literal with only 8 meaningful chars was an off-by-one read.
    // All strings are now exactly 8 printable characters with a null terminator.
    static const char* nano_state_strings[] = {
        "INIT    ",   // 8 chars + '\0'
        "IDLE    ",
        "NAVIGATE",
        "OBSTACLE",
        "DELIVER ",
        "RETURN  ",
        "RECOVERY",
        "LOW BAT ",
        "EMERGENC"    // truncated to exactly 8 printable chars
    };

    const char* ss = (state <= STATE_EMERGENCY) ? nano_state_strings[(int)state] : "UNKNOWN ";
    uint8_t payload[8U];
    for (uint8_t i = 0U; i < 8U; i++) {
        payload[i] = (uint8_t)(ss[i] ? (uint8_t)ss[i] : (uint8_t)' ');
    }

    uint8_t out[5U + 8U];
    // FIX [BUG-02]: Use corrected MSG_NANO_STATE (0x11) instead of the original
    // MSG_TYPE_NANO_STATE which collided with MSG_TYPE_ERROR (both 0x02).
    uint8_t len = MOD_PACKET_Build(MSG_NANO_STATE, payload, 8U, out);
    HAL_UART_SendBytes(UART_PORT_NANO, out, len);
}

// ============================================================
// MODULE: FLOOD FILL (grid mode only)
// ============================================================

#ifdef NAV_MODE_GRID_FLOODFILL

typedef enum { CELL_UNVISITED = 0, CELL_VISITED = 1, CELL_WALL = 2 } CellState;

static CellState _grid[FLOODFILL_MAX_CELLS];
// FIX [BUG-06]: BFS queue enlarged to FLOODFILL_BFS_QUEUE_SIZE (128).
// The original queue size equalled MAX_CELLS (64), but each cell can be
// re-enqueued when a shorter path is discovered before it is popped.
// Worst-case enqueues for a 64-cell 1-D chain = 2*(MAX_CELLS-1) ≈ 126.
// With a 64-entry queue, entries 65–126 would silently overwrite earlier
// entries, corrupting the BFS traversal and producing wrong flood values.
static uint8_t   _flood[FLOODFILL_MAX_CELLS];
static uint8_t   _current_cell        = 0;
static uint8_t   _total_cells         = 0;
static bool      _ff_at_junction      = false;
static int32_t   _ff_junction_enc_ref = 0;
static bool      _ff_exploration_done = false;

// Simple BFS flood fill from unvisited frontier outward
static void _ff_compute_flood(void) {
    // Initialize all flood values to max
    for (uint8_t i = 0; i < FLOODFILL_MAX_CELLS; i++) {
        _flood[i] = 255U;
    }

    // FIX [BUG-06]: Queue size is now FLOODFILL_BFS_QUEUE_SIZE (>= 2*MAX_CELLS)
    uint8_t queue[FLOODFILL_BFS_QUEUE_SIZE];
    uint8_t qhead = 0, qtail = 0;

    // Seed: unvisited cells get flood value 0
    for (uint8_t i = 0; i < _total_cells; i++) {
        if (_grid[i] == CELL_UNVISITED) {
            _flood[i] = 0U;
            queue[qtail] = i;
            qtail = (uint8_t)((qtail + 1U) % FLOODFILL_BFS_QUEUE_SIZE);
        }
    }

    // BFS outward
    while (qhead != qtail) {
        uint8_t cell = queue[qhead];
        qhead = (uint8_t)((qhead + 1U) % FLOODFILL_BFS_QUEUE_SIZE);

        // 1-D chain neighbours: cell-1 and cell+1
        // FIX [WARNING-4]: Use signed comparison; cast to int before
        // subtracting to avoid uint8_t underflow when cell == 0.
        int16_t neighbors[2] = { (int16_t)cell - 1, (int16_t)cell + 1 };
        for (uint8_t n = 0; n < 2U; n++) {
            int16_t nb = neighbors[n];
            if (nb < 0 || nb >= (int16_t)_total_cells) continue;
            if (_grid[(uint8_t)nb] == CELL_WALL) continue;
            // FIX [WARNING-5]: Guard against flood value overflow (255+1 wraps to 0)
            if (_flood[cell] == 255U) continue;
            uint8_t new_flood = (uint8_t)(_flood[cell] + 1U);
            if (new_flood < _flood[(uint8_t)nb]) {
                _flood[(uint8_t)nb] = new_flood;
                queue[qtail] = (uint8_t)nb;
                qtail = (uint8_t)((qtail + 1U) % FLOODFILL_BFS_QUEUE_SIZE);
            }
        }
    }
}

void FF_Init(void) {
    memset(_grid,  CELL_UNVISITED, sizeof(_grid));
    memset(_flood, 0,              sizeof(_flood));
    _current_cell        = 0;
    _total_cells         = 1;
    _ff_at_junction      = false;
    _ff_junction_enc_ref = 0;
    _ff_exploration_done = false;
}

void FF_Update(SensorFrame frame) {
    // Detect junction: popcount of line_bitmask >= threshold
    uint8_t sensor_count = 0;
    uint8_t bm = frame.line_bitmask;
    while (bm) { sensor_count += (bm & 1U); bm >>= 1U; }

    bool at_junction = (sensor_count >= FLOODFILL_JUNCTION_THRESHOLD);

    if (at_junction && !_ff_at_junction) {
        // Rising edge: arrived at new junction
        _ff_at_junction      = true;
        _ff_junction_enc_ref = frame.enc_left_ticks;

        // Mark current cell visited
        _grid[_current_cell] = CELL_VISITED;

        // Discover neighbours — expand total_cells if needed
        if ((_current_cell + 1U) >= _total_cells && _total_cells < FLOODFILL_MAX_CELLS) {
            _total_cells++;
        }

        // Recompute flood fill
        _ff_compute_flood();

        // Check if all cells visited
        _ff_exploration_done = true;
        for (uint8_t i = 0; i < _total_cells; i++) {
            if (_grid[i] == CELL_UNVISITED) { _ff_exploration_done = false; break; }
        }

        // Move to lowest flood-value neighbour
        uint8_t best_cell  = _current_cell;
        uint8_t best_flood = 255U;
        int16_t fwd  = (int16_t)_current_cell + 1;
        int16_t bkwd = (int16_t)_current_cell - 1;

        if (fwd < (int16_t)_total_cells &&
            _grid[(uint8_t)fwd] != CELL_WALL &&
            _flood[(uint8_t)fwd] < best_flood) {
            best_flood = _flood[(uint8_t)fwd];
            best_cell  = (uint8_t)fwd;
        }
        if (bkwd >= 0 &&
            _grid[(uint8_t)bkwd] != CELL_WALL &&
            _flood[(uint8_t)bkwd] < best_flood) {
            best_cell = (uint8_t)bkwd;
        }

        _current_cell = best_cell;

    } else if (!at_junction) {
        _ff_at_junction = false;
    }

    // Between junctions: PID line following at cruise speed
    MOD_PID_SetBaseSpeed(FLOODFILL_CRUISE_SPEED);
    MOD_PID_Update(frame.line_error);
    DRV_L298N_SetMotors(MOD_PID_GetLeftSpeed(), MOD_PID_GetRightSpeed());
}

bool FF_IsExplorationComplete(void) {
    return _ff_exploration_done;
}

void FF_Reset(void) {
    FF_Init();
}

#endif  // NAV_MODE_GRID_FLOODFILL

