Wa1eed12/Wa1eed12/ESP32_INTEGRATED.cpp
// ============================================================
// APP MAIN
// ============================================================

static SystemState _app_prev_state    = STATE_INIT;
static uint32_t    _app_telem_last_ms = 0;
static uint32_t    _app_loop_last_ms  = 0;

void APP_MAIN_Init(void) {
    // 1. HAL layer
    HAL_SYSTEM_Init();
    HAL_I2C_Init();
    HAL_UART_Init(UART_PORT_CAM);
    HAL_UART_Init(UART_PORT_NANO);
    HAL_ADC_Init();
    HAL_LEDC_Init();

    // 2. Drivers
    DRV_MPU9250_Init();
    DRV_AK8963_Init();
    DRV_TCS3200_Init();
    DRV_HCSR04_Init();
    DRV_LINE_Init();
    DRV_ENCODER_Init();
    DRV_L298N_Init();
    DRV_BATTERY_Init();

    // 3. Application modules
    MOD_SENSORFUSION_Init();
    MOD_PID_Init();
    MOD_SM_Init();
    MOD_UART_CAM_Init();
    MOD_UART_NANO_Init();
    MOD_UART_NANO_SendInit();
    PATH_Init();

    _app_prev_state    = STATE_INIT;
    _app_telem_last_ms = 0;
    _app_loop_last_ms  = HAL_SYSTEM_GetTick();

#ifdef NAV_MODE_GRID_FLOODFILL
    FF_Init();
#endif
}

void APP_MAIN_Run(void) {
    // Enforce exactly 10ms loop period (100Hz)
    uint32_t now     = HAL_SYSTEM_GetTick();
    uint32_t elapsed = now - _app_loop_last_ms;
    if (elapsed < (uint32_t)PID_SAMPLE_TIME_MS) {
        return;  // Not yet time — caller will re-invoke immediately
    }
    _app_loop_last_ms = now;

    // 1. Feed watchdog
    HAL_SYSTEM_FeedWatchdog();

    // 2. Update sensor fusion
    MOD_SENSORFUSION_Update();

    // 3. Get current sensor frame
    SensorFrame frame = MOD_SENSORFUSION_GetFrame();

    // 4. State machine update
    MOD_SM_Update(frame);

    // 5. Process inbound bytes from CAM
    MOD_UART_CAM_ProcessRx();

    // 6. Send telemetry every 100ms (10Hz)
    if ((frame.timestamp_ms - _app_telem_last_ms) >= TELEMETRY_SEND_INTERVAL_MS) {
        _app_telem_last_ms = frame.timestamp_ms;
        MOD_UART_CAM_SendTelemetry(frame, MOD_SM_GetState());
    }

    // 7. Send state update to Nano on state change
    SystemState cur_state = MOD_SM_GetState();
    if (cur_state != _app_prev_state) {
        MOD_UART_NANO_SendState(cur_state);
        _app_prev_state = cur_state;
    }
}
